[
  {
    "id": "raceDwarf",
    "name": "Dwarf",
    "traits":[
        "Your dwarf character has an assortment of inborn abilities, part and parcel of dwarven nature.",
        "***Ability Score Increase.*** Your Constitution score increases by 2.",
        "***Age.*** Dwarves mature at the same rate as humans, but they’re considered young until they reach the age of 50. On average, they live about 350 years.",
        "***Alignment.*** Most dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order.",
        "***Size.*** Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium.",
        "***Speed.*** Your base walking speed is 25 feet. Your speed is not reduced by wearing heavy armor.",
        "***Darkvision.*** Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
        "***Dwarven Resilience.*** You have advantage on saving throws against poison, and you have resistance against poison damage.",
        "***Dwarven Combat Training.*** You have proficiency with the battleaxe, handaxe, light hammer, and warhammer.",
        "***Tool Proficiency.*** You gain proficiency with the artisan’s tools of your choice: smith’s tools, brewer’s supplies, or mason’s tools.",
        "***Stonecunning.*** Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus.",
        "***Languages.*** You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak."
    ]
  },
  {
    "id": "raceHillDwarf",
    "name": "Hill Dwarf",
    "traits": [
        "As a hill dwarf, you have keen senses, deep intuition, and remarkable resilience.",
        "Your hill dwarf character has an assortment of inborn abilities, part and parcel of dwarven nature.",
        "***Ability Score Increase.*** Your Constitution score increases by 2. Your Wisdom score increases by 1.",
        "***Age.*** Hill dwarves mature at the same rate as humans, but they’re considered young until they reach the age of 50. On average, they live about 350 years.",
        "***Alignment.*** Most hill dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order.",
        "***Size.*** Hill dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium.",
        "***Speed.*** Your base walking speed is 25 feet. Your speed is not reduced by wearing heavy armor.",
        "***Darkvision.*** Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
        "***Dwarven Resilience.*** You have advantage on saving throws against poison, and you have resistance against poison damage.",
        "***Dwarven Toughness.*** Your hit point maximum increases by 1, and it increases by 1 every time you gain a level. "
        "***Dwarven Combat Training.*** You have proficiency with the battleaxe, handaxe, light hammer, and warhammer.",
        "***Tool Proficiency.*** You gain proficiency with the artisan’s tools of your choice: smith’s tools, brewer’s supplies, or mason’s tools.",
        "***Stonecunning.*** Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus.",
        "***Languages.*** You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak."
    ]

  },
  {
    "id":"raceHuman",
    "name":"Human",
    "traits":  [
      "It’s hard to make generalizations about humans, but your human character has these traits.",
      "***Ability Score Increase.*** Your ability scores each increase by 1.",
      "***Age.*** Humans reach adulthood in their late teens and live less than a century.",
      "***Alignment.*** Humans tend toward no particular alignment. The best and the worst are found among them.",
      "***Size.*** Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium.",
      "***Speed.*** Your base walking speed is 30 feet. ***Languages.*** You can speak, read, and write Common and one extra language of your choice.",
      "Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."
    ]
  }

]
