[
  {
    "id": "featureRage",
    "name": "Rage",
    "content": [],
    "description": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action. \n While raging, you gain the following benefits if you aren’t wearing heavy armor:\nYou have advantage on Strength checks and Strength saving throws.\nWhen you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table.\nYou have resistance to bludgeoning, piercing, and slashing damage.\nIf you are able to cast spells, you can’t cast them or concentrate on them while raging.\nYour rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven’t attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.\nOnce you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian"
    ],
    "levelingInfo": [
      [
        "Rages: ",
        "2",
        "2",
        "3",
        "3",
        "3",
        "4",
        "4",
        "4",
        "4",
        "4",
        "4",
        "5",
        "5",
        "5",
        "5",
        "5",
        "6",
        "6",
        "6",
        "Unlimited"
      ],
      [
        "Rage Damage: ",
        "2",
        "2",
        "2",
        "2",
        "2",
        "2",
        "2",
        "2",
        "3",
        "3",
        "3",
        "3",
        "3",
        "3",
        "3",
        "4",
        "4",
        "4",
        "4",
        "4"
      ]
    ]
  },
  {
    "id": "featureUnarmoredDefense",
    "name": "Unarmored Defense",
    "content": [],
    "description": "Barabarians: While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit./nMonks: Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier. ",
    "classes": [
      "Barbarian",
      "Monk"
    ],
    "tags": [
      "Barbarian",
      "Monk"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureRecklessAttack",
    "name": "Reckless Attack",
    "content": [],
    "description": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureDangerSense",
    "name": "Danger Sense",
    "content": [],
    "description": "At 2nd level, you gain an uncanny sense of when things nearby aren’t as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can’t be blinded, deafened, or incapacitated.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featurePrimalPath",
    "name": "Primal Path",
    "content": [
      "featurePathOfTheBerserker",
      "featurePathOfTheTotemWarrior"
    ],
    "description": "At 3rd level, you choose a path that shapes the nature of your rage. Choose the Path of the Berserker or the Path of the Totem Warrior, both detailed at the end of the class description. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian",
      "Primal Path",
      "Path of the Berserker",
      "Path of the Totem Warrior"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureFastMovement",
    "name": "Fast Movement",
    "content": [],
    "description": "Starting at 5th level, your speed increases by 10 feet while you aren’t wearing heavy armor.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureFeralInstinct",
    "name": "Feral Instinct",
    "content": [],
    "description": "By 7th level, your instincts are so honed that you have advantage on initiative rolls./nAdditionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureBrutalCritical",
    "name": "Brutal Critical",
    "content": [],
    "description": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack./nThis increases to two additional dice at 13th level and three additional dice at 17th level.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureRelentlessRage",
    "name": "Relentless Rage",
    "content": [],
    "description": "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you’re raging and don’t die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead./nEach time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featurePersistentRage",
    "name": "Persistent Rage",
    "content": [],
    "description": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureIndomitableMight",
    "name": "Indomitable Might",
    "content": [],
    "description": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featurePrimalChampion",
    "name": "Primal Champion",
    "content": [],
    "description": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featurePathOfTheBerserker",
    "name": "Path Of The Berserker",
    "content": [
      "featureFrenzy",
      "featureMindlessRage",
      "featureIntimidatingPresence",
      "featureRetaliation"
    ],
    "description": "For some barbarians, rage is a means to an end— that end being violence. The Path of the Berserker is a path of untrammeled fury, slick with blood. As you enter the berserker’s rage, you thrill in the chaos of battle, heedless of your own health or well-being.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian",
      "Primal Path"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureFrenzy",
    "name": "Frenzy",
    "content": [],
    "description": "Starting when you choose this path at 3rd level, you can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion (as described in appendix A).",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureMindlessRage",
    "name": "Mindless Rage",
    "content": [],
    "description": "Beginning at 6th level, you can’t be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureIntimidatingPresence",
    "name": "Intimidating Presence",
    "content": [],
    "description": "Beginning at 10th level, you can use your action to frighten someone with your menacing presence. When you do so, choose one creature that you can see within 30 feet of you. If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn. This effect ends if the creature ends its turn out of line of sight or more than 60 feet away from you.\nIf the creature succeeds on its saving throw, you can’t use this feature on that creature again for 24 hours.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureRetaliation",
    "name": "Retaliation",
    "content": [],
    "description": "Starting at 14th level, when you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featurePathOfTheTotemWarrior",
    "name": "Path of the Totem Warrior",
    "content": [
      "featureSpiritSeeker",
      "featureSpiritTotem",
      "featureAspectOfTheBeast",
      "featureSpiritWalker",
      "featureTotemicAttunement"
    ],
    "description": "The Path of the Totem Warrior is a spiritual journey, as the barbarian accepts a spirit animal as guide, protector, and inspiration. In battle, your totem spirit fills you with supernatural might, adding magical fuel to your barbarian rage.\nMost barbarian tribes consider a totem animal to be kin to a particular clan. In such cases, it is unusual for an individual to have more than one totem animal spirit, though exceptions exist.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian",
      "Primal Path"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureSpiritSeeker",
    "name": "Spirit Seeker",
    "content": [],
    "description": "Yours is a path that seeks attunement with the natural world, giving you a kinship with beasts. At 3rd level when you adopt this path, you gain the ability to cast the beast sense and speak with animals spells, but only as rituals, as described in chapter 10.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian",
      "Totem Warrior",
      "Primal Path"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTotemSpirt",
    "name": "Totem Spirt",
    "content": [
      "Totem Spirit - Bear: While raging, you have resistance to all damage except psychic damage. The spirit of the bear makes you tough enough to stand up to any punishment.",
      "Totem Spirit - Eagle: While you're raging and aren’t wearing heavy armor, other creatures have disadvantage on opportunity attack rolls against you, and you can use the Dash action as a bonus action on your turn. The spirit of the eagle makes you into a predator who can weave through the fray with ease.",
      "Totem Spirit - Wolf: While you're raging, your friends have advantage on melee attack rolls against any creature within 5 feet of you that is hostile to you. The spirit of the wolf makes you a leader of hunters"
    ],
    "description": "At 3rd level, when you adopt this path, you choose a totem spirit and gain its feature. You must make or acquire a physical totem object-an amulet or similar adornment-that incorporates fur or feathers, claws, teeth, or bones of the totem animal. At your option you also gain minor physical attributes that are reminiscent of your totem spirit. For example, if you have a bear totem spirit, you might be unusually hairy and thick-skinned, or if your totem is the eagle, your eyes turn bright yellow./nYour totem animal might be an animal related to those listed here but more appropriate to your homeland. For example, you could choose a hawk or vulture in place of an eagle.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian",
      "Totem Warrior",
      "Primal Path",
      "Bear",
      "Eagle",
      "Wolf"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureAspectOfTheBeast",
    "name": "Aspect of the Beast",
    "content": [
      "Aspect of the Beast - Bear: You gain the might of a bear. Your carrying capacity (including maximum load and maximum lift) is doubled, and you have advantage on Strength checks made to push, pull, lift, or break objects.",
      "Aspect of the Beast - Eagle: You gain the eyesight of an eagle. You can see up to 1 mile away with no difficulty, able to discern even fine details as though looking at something no more than 100 feet away from you. Additionally, dim light doesn't im pose disadvantage on your W isdom (Perception) checks.",
      "Aspect of the Beast - Wolf: You gain the hunting sensibilities of a wolf. You can track other creatures while traveling at a fast pace, and you can move stealthily while traveling at a normal pace (see chapter 8 for rules on travel pace)."
    ],
    "description": "At 6th level, you gain a magical benefit based on the totem animal of your choice. You can choose the same animal you selected at 3rd level or a different one.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian",
      "Totem Warrior",
      "Primal Path",
      "Bear",
      "Eagle",
      "Wolf"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureSpiritWalker",
    "name": "Spirit Walker",
    "content": [],
    "description": "At 10th level, you can cast the commune with nature spell, but only as a ritual. When you do so, a spiritual version of one of the animals you chose for Totem Spirit or Aspect of the Beast appears to you to convey the information you seek.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian",
      "Totem Warrior",
      "Primal Path"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTotemicAttunement",
    "name": "Totemic Attunement",
    "content": [
      "Totemic Attunement - Bear: While you’re raging, any creature within 5 feet of you that’s hostile to you has disadvantage on attack rolls against targets other than you or another character with this feature. An enemy is immune to this effect if it can’t see or hear you or if it can’t be frightened.",
      "Totemic Attunement - Eagle: While raging, you have a flying speed equal to your current walking speed. This benefit works only in short bursts; you fall if you end your turn in the air and nothing else is holding you aloft.",
      "Totemic Attunement - Wolf: While you’re raging, you can use a bonus action on your turn to knock a Large or smaller creature prone when you hit it with melee weapon attack."
    ],
    "description": "At 14th level, you gain a magical benefit based on a totem animal of your choice. You can choose the same animal you selected previously or a different one.",
    "classes": [
      "Barbarian"
    ],
    "tags": [
      "Barbarian",
      "Totem Warrior",
      "Primal Path"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureAbilityScoreImprovement",
    "name": "Ability Score Improvement",
    "content": [],
    "description": "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.",
    "classes": [
      "Barbarian",
      "Bard",
      "Cleric",
      "Druid",
      "Fighter",
      "Monk",
      "Paladin",
      "Ranger",
      "Rogue",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "tags": [
      "Barbarian",
      "Bard",
      "Cleric",
      "Druid",
      "Fighter",
      "Monk",
      "Paladin",
      "Ranger",
      "Rogue",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "levelingInfo": [
      [
        "classBarbarian",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "1",
        "0"
      ],
      [
        "classBard",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "1",
        "0"
      ],
      [
        "classCleric",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "1",
        "0"
      ],
      [
        "classDruid",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "1",
        "0"
      ],
      [
        "classFighter",
        "0",
        "0",
        "0",
        "1",
        "0",
        "1",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "1",
        "0",
        "1",
        "0",
        "0",
        "1",
        "0"
      ],
      [
        "classMonk",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "1",
        "0"
      ],
      [
        "classPaladin",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "1",
        "0"
      ],
      [
        "classRanger",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "1",
        "0"
      ],
      [
        "classRogue",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "1",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "1",
        "0"
      ],
      [
        "classSorcerer",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "1",
        "0"
      ],
      [
        "classWarlock",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "1",
        "0"
      ],
      [
        "classWizard",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "1",
        "0"
      ]
    ]
  },
  {
    "id": "featureExtraAttack",
    "name": "Extra Attack",
    "content": [],
    "description": "You can attack multiple times when taking the Attack action on your turn.",
    "classes": [
      "Barbarian",
      "Fighter",
      "Monk",
      "Paladin",
      "Ranger"
    ],
    "tags": [
      "Barbarian",
      "Fighter",
      "Monk",
      "Paladin",
      "Ranger"
    ],
    "levelingInfo": [
      [
        "classBarbarian",
        null,
        null,
        null,
        null,
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "classBard",
        null,
        null,
        null,
        null,
        null,
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "classCleric",
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
      ],
      [
        "classDruid",
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
      ],
      [
        "classFighter",
        null,
        null,
        null,
        null,
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "2",
        "2",
        "2",
        "2",
        "2",
        "2",
        "2",
        "2",
        "2",
        "3"
      ],
      [
        "classMonk",
        null,
        null,
        null,
        null,
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "classPaladin",
        null,
        null,
        null,
        null,
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "classRanger",
        null,
        null,
        null,
        null,
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "classRogue",
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
      ],
      [
        "classSorcerer",
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
      ],
      [
        "classWarlock",
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
      ],
      [
        "classWizard",
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
      ]
    ]
  },
  {
    "id": "featureSpellcastingBard",
    "name": "Bard Spellcasting",
    "content": [
      "spellBladeWard",
      "spellDancingLights",
      "spellFriends",
      "spellLight",
      "spellMageHand",
      "spellMending",
      "spellMessage",
      "spellMinorIllusion",
      "spellPrestidigitation",
      "spellTrueStrike",
      "spellViciousMockery",
      "spellAnimalFriendship",
      "spellBane",
      "spellCharmPerson",
      "spellComprehendLanguages",
      "spellCureWounds",
      "spellDetectMagic",
      "spellDisguiseSelf",
      "spellDissonantWhispers",
      "spellFaerieFire",
      "spellFeatherFall",
      "spellHealingWord",
      "spellHeroism",
      "spellIdentify",
      "spellIllusoryScript",
      "spellLongstrider",
      "spellSilentImage",
      "spellSleep",
      "spellSpeakWithAnimals",
      "spellTashasHideousLaughter",
      "spellThunderwave",
      "spellUnseenServant",
      "spellAnimalMessenger",
      "spellBlindnessDeafness",
      "spellCalmEmotions",
      "spellCloudOfDaggers",
      "spellCrownOfMadness",
      "spellDetectThoughts",
      "spellEnhanceAbility",
      "spellEnthrall",
      "spellHeatMetal",
      "spellHoldPerson",
      "spellInvisibility",
      "spellKnock",
      "spellLesserRestoration",
      "spellLocateAnimalsOrPlants",
      "spellLocateObject",
      "spellMagicMouth",
      "spellPhantasmalForce",
      "spellSeeInvisibility",
      "spellShatter",
      "spellSilence",
      "spellSuggestion",
      "spellZoneOfTruth",
      "spellBestowCurse",
      "spellClairvoyance",
      "spellDispelMagic",
      "spellFear",
      "spellFeignDeath",
      "spellGlyphOfWarding",
      "spellHypnoticPattern",
      "spellLeomundsTinyHut",
      "spellMajorImage",
      "spellNondetection",
      "spellPlantGrowth",
      "spellSending",
      "spellSpeakWithDead",
      "spellSpeakWithPlants",
      "spellStinkingCloud",
      "spellTongues",
      "spellCompulsion",
      "spellConfusion",
      "spellDimensionDoor",
      "spellFreedomOfMovement",
      "spellGreaterInvisibility",
      "spellHallucinatoryTerrain",
      "spellLocateCreature",
      "spellPolymorph",
      "spellAnimateObjects",
      "spellAwaken",
      "spellDominatePerson",
      "spellDream",
      "spellGeas",
      "spellGreaterRestoration",
      "spellHoldMonster",
      "spellLegendLore",
      "spellMassCureWounds",
      "spellMislead",
      "spellModifyMemory",
      "spellPlanarBinding",
      "spellRaiseDead",
      "spellScrying",
      "spellSeeming",
      "spellTeleportationCircle",
      "spellEyebite",
      "spellFindThePath",
      "spellGuardsAndWards",
      "spellMassSuggestion",
      "spellOttosIrresistibleDance",
      "spellProgrammedIllusion",
      "spellTrueSeeing",
      "spellEtherealness",
      "spellForcecage",
      "spellMirageArcane",
      "spellMordenkainensMagnificentMansion",
      "spellMordenkainensSword",
      "spellProjectImage",
      "spellRegenerate",
      "spellResurrection",
      "spellSymbol",
      "spellTeleport",
      "spellDominateMonster",
      "spellFeeblemind",
      "spellGlibness",
      "spellMindBlank",
      "spellPowerWordStun",
      "spellForesight",
      "spellPowerWordHeal",
      "spellPowerWordKill",
      "spellTruePolymorph"
    ],
    "description": "You have learned to untangle and reshape the fabric of reality in harmony with your wishes and music. Your spells are part of your vast repertoire, magic that you can tune to different situations./nSpell Save DC = 8 + your proficiency bonus + your Charisma modifier /nSpell attack modifier = your proficiency bonus + your Charisma modifier",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard",
      "Spellcasting"
    ],
    "levelingInfo": [
      [
        "2",
        "4",
        "2",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "2",
        "5",
        "3",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "2",
        "6",
        "4",
        "2",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "7",
        "4",
        "3",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "8",
        "4",
        "3",
        "2",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "9",
        "4",
        "3",
        "3",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "10",
        "4",
        "3",
        "3",
        "1",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "11",
        "4",
        "3",
        "3",
        "2",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "12",
        "4",
        "3",
        "3",
        "3",
        "1",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "14",
        "4",
        "3",
        "3",
        "3",
        "2",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "15",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "",
        "",
        ""
      ],
      [
        "4",
        "15",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "",
        "",
        ""
      ],
      [
        "4",
        "16",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "",
        ""
      ],
      [
        "4",
        "18",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "",
        ""
      ],
      [
        "4",
        "19",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        ""
      ],
      [
        "4",
        "19",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        ""
      ],
      [
        "4",
        "20",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "4",
        "22",
        "4",
        "3",
        "3",
        "3",
        "3",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "4",
        "22",
        "4",
        "3",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1"
      ],
      [
        "4",
        "22",
        "4",
        "3",
        "3",
        "3",
        "3",
        "2",
        "2",
        "1",
        "1"
      ]
    ]
  },
  {
    "id": "featureBardicInspiration",
    "name": "Bardic Inspiration",
    "content": [],
    "description": "You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6./nOnce within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the GM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time./nYou can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest./nYour Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard"
    ],
    "levelingInfo": [
      [
        "Bardic Inspiration Die: ",
        "d6",
        "d6",
        "d6",
        "d6",
        "d8",
        "d8",
        "d8",
        "d8",
        "d8",
        "d10",
        "d10",
        "d10",
        "d10",
        "d10",
        "d12",
        "d12",
        "d12",
        "d12",
        "d12",
        "d12"
      ]
    ]
  },
  {
    "id": "featureJackOfAllTrades",
    "name": "Jack of All Trades",
    "content": [],
    "description": "Starting at 2nd level, you can add half your proficiency bonus, rounded down to any ability check you make that doesn't already include your proficiency bonus.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureSongOfRest",
    "name": "Song of Rest",
    "content": [],
    "description": "Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points./nThe extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard"
    ],
    "levelingInfo": [
      [
        "Song of Rest Die: ",
        "d6",
        "d6",
        "d6",
        "d6",
        "d6",
        "d6",
        "d6",
        "d6",
        "d8",
        "d8",
        "d8",
        "d8",
        "d10",
        "d10",
        "d10",
        "d10",
        "d12",
        "d12",
        "d12",
        "d12"
      ]
    ]
  },
  {
    "id": "featureBardColleges",
    "name": "Bard Colleges",
    "content": [
      "featureCollegeOfLore",
      "featureCollegeOfValor"
    ],
    "description": "The way of the bard is gregarious. Bards seek each other out to swap songs and stories, boast of their accomplishments, and share their knowledge. Bards form loose associations, which they call colleges, to facilitate their gatherings and preserve their traditions.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard",
      "Bard Colleges",
      "College of Lore",
      "College of Valor"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureCollegeOfLore",
    "name": "College of Lore",
    "content": [
      "featureBonusProficienciesBard",
      "featureCuttingWords",
      "featureAdditionalMagicalSecrets",
      "featurePeerlessSkill"
    ],
    "description": "Bards of the College of Lore know someting about most things, collecting bits of knowledge from sources as diverse as scholarly tomes and peasant tales./nWhether singing folk ballads in taverns or elaborate compositions in royal courts, these bards use their gifts to hold audiences spellbound. When the applause dies down, the audience members might find themselves questioning everything they held to be true, from their faith in the priesthood of the local temple to their loyalty to the king./nThe loyalty of these bards lies in the pursuit of beauty and truth, not in fealty to a monarch or following the tenets of a deity. A noble who keeps such a bard as a herald or advisor knows that the bard would rather be honest htan politic./nThe college's members gather in libraries and sometimes in actual colleges, complete with classrooms and dormitories, to share their lore with one another. They also meet at festivals or affairs of state, where they can expose corruption, unravel lies, and poke fun at self-important figures of authority.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard",
      "Bard Colleges",
      "College of Lore"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureCollegeOfValor",
    "name": "College of Valor",
    "content": [
      "featureBonusProficienciesBard",
      "featureCombatInspiration",
      "featureExtraAttack",
      "featureBattleMagic"
    ],
    "description": "Bards of the College of Valor are daring skalds whose tales keep alive the memory of the great heroes of the past, and thereby inspire a new generation of heroes. These bards gather in mead halls or around great bonfires to sing the deeds of the mighty, both past and present. They travel the land to witness great events firsthand and to ensure that the meory of those events doesn't pass from the world. With their songs, they inspire others to reach the same heights of accomplishment as the heroes of old.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard",
      "Bard Colleges",
      "College of Valor"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureExpertiseBard",
    "name": "Expertise",
    "content": [],
    "description": "At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies. At 10th level you cn choose another two skill proficiencies to gain this benefit.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard"
    ],
    "levelingInfo": [
      [
        "",
        "",
        "2",
        "",
        "",
        "",
        "",
        "",
        "",
        "2",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    ]
  },
  {
    "id": "featureFontOfInspiration",
    "name": "Font of Inspiration",
    "content": [],
    "description": "Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureCountercharm",
    "name": "Countercharm",
    "content": [],
    "description": "At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required).",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureMagicalSecrets",
    "name": "Magical Secrets",
    "content": [],
    "description": "By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any class, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip./nThe chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table./nYou learn two additional spells from any class at 14th level and again at 18th level.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard"
    ],
    "levelingInfo": [
      [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "2",
        "",
        "",
        "",
        "2",
        "",
        "",
        "",
        "2",
        "",
        ""
      ]
    ]
  },
  {
    "id": "featureSuperiorInspiration",
    "name": "Superior Inspiration",
    "content": [],
    "description": "At 20th level, when you roll for initiative and have no uses of Bardic Inspiration left, you gain one use.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureBonusProficienciesBard",
    "name": "Bonus Proficiencies",
    "content": [
      "When you join the College of Lore at 3rd level, you gain proficiency with three skills of your choice.",
      "When you join the College of Valor at 3rd level, you gain proficiency with medium armor, shields, and martial weapons."
    ],
    "description": "When you join a college at 3rd level you gain proficiency with three skills of your choice if you choose the College of Lore or you gain proficiency with medium armor, shields and martial weapons if you choose the College of Valor.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard",
      "College of Lore",
      "College of Valor"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureCuttingWords",
    "name": "Cutting Words",
    "content": [],
    "description": "Also at 3rd level, you learn how to use your wit to distract, confuse, and otherwise sap the confidence and competence of others. When a creature that you can see within 60 feet of you makes an attack roll, an ability check, or a damage roll, you can use your reaction to expend one of your uses of Bardic Inspiration, rolling a Bardic Inspiration die and subtracting the number rolled from the creature’s roll. You can choose to use this feature after the creature makes its roll, but before the GM determines whether the attack roll or ability check succeeds or fails, or before the creature deals its damage. The creature is immune if it can’t hear you or if it’s immune to being charmed.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard",
      "College of Lore"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureAdditionalMagicalSecrets",
    "name": "Additional Magical Secrets",
    "content": [],
    "description": "At 6th level, you learn two spells of your choice form any class. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you, but don't count against the number of bard spells you know.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard",
      "College of Lore"
    ],
    "levelingInfo": [
      [
        "",
        "",
        "",
        "",
        "",
        "2",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    ]
  },
  {
    "id": "featurePeerlessSkill",
    "name": "Peerless Skill",
    "content": [],
    "description": "Starting at 14th level, when you make an ability check, you can expend one use of Bardic Inspiration. Roll a Bardic Inspiration die and add the number rolled to your ability check. You can choose to do so after you roll the die for the ability check, but before the GM tells you whether you succeed or fail.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard",
      "College of Lore"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureCombatInspiration",
    "name": "Combat Inspiration",
    "content": [],
    "description": "Also at 3rd level, you learn to inspire others in battle. A creature tht has a Bardic Inspiration die from you can roll that die and add the number rolled to a weapon damage roll it just made. Alternatively, when at attack roll is made against the creature, it can use its reaction to roll the Bardic Inspiration die and add the number rolled to its AC against that attack, after seeing the roll but before knowing whether it hits or misses.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard",
      "College of Valor"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureBattleMagic",
    "name": "Battle Magic",
    "content": [],
    "description": "At 14th level, you have mastered the art of weaving spellcasting and weapon use into a single harmonious act. When you use your action to cast a bard spell, you can make one weapon attack as a bonus action.",
    "classes": [
      "Bard"
    ],
    "tags": [
      "Bard",
      "College of Valor"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureSpellcastingCleric",
    "name": "Cleric Spellcasting",
    "content": [
      "spellGuidance",
      "spellLight",
      "spellMending",
      "spellResistance",
      "spellSacredFlame",
      "spellSpareTheDying",
      "spellThaumaturgy",
      "spellBane",
      "spellBless",
      "spellCommand",
      "spellCreateOrDestroyWater",
      "spellCureWounds",
      "spellDetectEvilAndGood",
      "spellDetectMagic",
      "spellDetectPoisonAndDisease",
      "spellGuidingBolt",
      "spellHealingWord",
      "spellInflictWOunds",
      "spellProtectionFromEvilAndGood",
      "spellPurifyFoodAndDrink",
      "spellSanctuary",
      "spellShieldOfFaith",
      "spellAid",
      "spellAugury",
      "spellBlindnessDeafness",
      "spellCalmEmotions",
      "spellContinualFlame",
      "spellEnhanceAbility",
      "spellFindTraps",
      "spellGentleRepose",
      "spellHoldPerson",
      "spellLesserRestoration",
      "spellLocateObject",
      "spellPrayerOfHealing",
      "spellProtectionFromPoison",
      "spellSilence",
      "spellSpiritualWeapon",
      "spellWardingBond",
      "spellZoneOfTruth",
      "spellAnimateDead",
      "spellBeaconOfHope",
      "spellBestowCurse",
      "spellClairvoyance",
      "spellCreateFoodAndWater",
      "spellDaylight",
      "spellDispelMagic",
      "spellFeignDeath",
      "spellGlyphOfWarding",
      "spellMagicCircle",
      "spellMassHealingWord",
      "spellMeldIntoStone",
      "spellProtectionFromEnergy",
      "spellRemoveCurse",
      "spellRevivify",
      "spellSending",
      "spellSpeakWithDead",
      "spellSpiritGuardians",
      "spellTongues",
      "spellWaterWalk",
      "spellBanishment",
      "spellControlWater",
      "spellDeathWard",
      "spellDivination",
      "spellFreedomOfMovement",
      "spellGuardianOfFaith",
      "spellLocateCreature",
      "spellStoneShape",
      "spellCommune",
      "spellContagion",
      "spellDispelGoodAndEvil",
      "spellFlameStrike",
      "spellGeas",
      "spellGreaterRestoration",
      "spellHallow",
      "spellInsectPlague",
      "spellLegendLore",
      "spellMassCureWounds",
      "spellPlanarBinding",
      "spellRaiseDead",
      "spellScrying",
      "spellBladeBarrier",
      "spellCreateUndead",
      "spellFindThePath",
      "spellForbiddance",
      "spellHarm",
      "spellHeal",
      "spellHeroesFeast",
      "spellPlanarAlly",
      "spellTrueSeeing",
      "spellWordOfRecall",
      "spellConjureCelestial",
      "spellDivineWord",
      "spellEtherealness",
      "spellFireStorm",
      "spellPlaneShift",
      "spellRegenerate",
      "spellResurrection",
      "spellSymbol",
      "spellAntimagicField",
      "spellControlWeather",
      "spellEarthquake",
      "spellHolyAura",
      "spellAstralProjection",
      "spellGate",
      "spellMassHeal",
      "spellTrueResurrection"
    ],
    "description": "As a conduit for divine power, you can cast cleric spells/nSpell Save DC = 8 + your proficiency bonus + your Wisdom modifier/nSpell attack modifier = your proficiency bonus + your Wisdom modifier",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Spellcasting"
    ],
    "levelingInfo": [
      [
        "3",
        "2",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "3",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "4",
        "2",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "2",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "1",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "2",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "3",
        "1",
        "",
        "",
        "",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "",
        "",
        "",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "",
        "",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "",
        "",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "3",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1"
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "3",
        "2",
        "2",
        "1",
        "1"
      ]
    ]
  },
  {
    "id": "featureDivineDomain",
    "name": "Divine Domain",
    "content": [
      "featureKnowledgeDomain",
      "featureLifeDomain",
      "featureLightDomain",
      "featureNatureDomain",
      "featureTempestDomain",
      "featureTrickeryDomain",
      "featureWarDomain"
    ],
    "description": "Choose one domain related to your deity: Knowledge, Life, Light, Nature, Tempest, Trickery, or War. Each domain is detailed at the end of the class description, and each one provides examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Divine Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureKnowledgeDomain",
    "name": "Knowledge Domain",
    "content": [
      "featureKnowledgeDomainSpells",
      "featureBlessingsOfKnowledge",
      "featureChannelDivinityKnowledgeOfTheAges",
      "featureChannelDivinityReadThoughts",
      "featurePotentSpellcasting",
      "featureVisionsOfThePast"
    ],
    "description": "The gods of knowledge-including Oghma, Boccob, Gilean, Aureon, and Thoth-value learning and understanding above all. Some teach that knowledge is to be gathered and shared in libraries and universities, or promote the practical knowledge of craft and invention. Some deities hoard knowledge and keep its secretes to themselves. And some promise their followers that they will gain tremendous power if they unlock the secrets of the multiverse. Followers of these gods study esoteric lore, collect old tomes, delve into the secret places of the earth, and learn all they can. Some gods of knowledge promote the practical knowledge of craft and invention, including smith deities like Gond, Reorx, Onatar, Moradin, Hephaestus, and Goibhniu.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Knowledge Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureKnowledgeDomainSpells",
    "name": "Knowledge Domain Spells",
    "content": [],
    "description": "You gain the following spells at the indicated Cleric level. Once you gain these spells they are always prepared and don't count against your daily limit. If the spell isn't on the cleric spell list it is nonetheless a cleric spell for you./n1st level: command, indentify/n3rd level: augury, suggestion/n5th level: nondetection, speak with dead/n7th level: arcane eye, confusion/n9th level: legend lore, scrying",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Knowledge Domain"
    ],
    "levelingInfo": [
      [
        "spellCommand",
        "spellIdentify"
      ],
      [],
      [
        "spellAugury",
        "spellSuggestion"
      ],
      [],
      [
        "spellNondetection",
        "spellSpeakWithDead"
      ],
      [],
      [
        "spellArcaneEye",
        "spellConfusion"
      ],
      [],
      [
        "spellLegendLore",
        "spellScrying"
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      []
    ]
  },
  {
    "id": "featureBlessingsOfKnowledge",
    "name": "BLessings of Knowledge",
    "content": [],
    "description": "At 1st level, you learn two languages of your choice. You also become proficient in your choice of two of the following skills: Arcana, Histroy, Nature, or Religion./nYour proficiency bonus is doubled for any ability check you make that uses either of those skills.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Knowledge Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureChannelDivinityKnowledgeOfTheAges",
    "name": "Channel Divinity: Knowledge of the Ages",
    "content": [],
    "description": "Starting at 2nd level, you can use your Channel Divinity to tap into a divine well of knowledge. As an action, you choose one skill or tool. For 10 minutes, you have proficiency with the chosen skill or tool.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Knowledge Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureChannelDivinityReadThoughts",
    "name": "Channel Divinity: Read Thoughts",
    "content": [],
    "description": "At 6th level, you can use your Channel Divinity to read a creature's thoughts. You can then use your access to the creature's mind to command it./nAs an action, choose one creature that you can see within 60 feet of you. That creature must make a Wisdom saving throw. If the creature succeeds on the saving throw, you can't use this feature on it again until you finish a long rest./nIf the creature fails its save, you can read its surface thoughts (those foremost in its mind, reflecting its current emotions and what it is actively thinking about) when it is within 60 feet of you. This effect lasts for 1 minute./nDuring that time, you can use your action to end this effect and cast the suggestion spell on the creature without expending a spell slot. The target automatically fails its saving throw against the spell.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Knowledge Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featurePotentSpellcasting",
    "name": "Potent Spellcasting",
    "content": [],
    "description": "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Knowledge Domain",
      "Light Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureVisionsOfThePast",
    "name": "Visions of the Past",
    "content": [],
    "description": "Starting at 17th level, you can call up visions of the past that relate to an object you hold or your immediate surroundings. You must spend at least 1 minute in meditation and prayer, then receive dreamlike, shadowy glimpses of recent events. You can meditate in this way for a number of minutes equal to your Wisdom score and must maintain concentration during that time, as if you were casting a spell./nOnce you use this feature, you can't use it again until you finish a short or long rest./nObject Reading - Holding an object as you meditate, you can see visions of the object's previous owner. After meditating for 1 minute, you learn how the owner acquired and lost the object, as well as the most recent significant event involving the object and that owner. If the object was owned by another creature in the recent past (within a number of daysd equal to your Wisdom score), you can spend 1 additional minute for each owner to learn the same information about that creature./nArea Reading - As you meditate, you see visions of recent events in your immediate vicinity (a room, street, tunnel, clearing, or the like, up to a 50-foot cube), going back a number of days equal to your Wisdom score. For each minute you meditate, you learn about one significant event, beginning with the most recent. Significant events typically involve powerful emotions, such as battles and betrayals, marriages and murders, births and funerals. However they might also include more mundane events that are nevertheless important in your current situation.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureLifeDomain",
    "name": "Life Domain",
    "content": [
      "featureLifeDomainSpells",
      "featureBonusProficiencyLifeDomain",
      "featureDiscipleOfLife",
      "featureChannelDivinityPreserveLife",
      "featureBlessedHealer",
      "featureDivineStrikeLifeDomain",
      "featureSupremeHealing"
    ],
    "description": "The Life domain focuses on the vibrant positive energy-one of the fundamental forces of the universe-that sustains life. THe gods of life promote vitality and health through healing the sick and wounded, caring for those in need, and driving away the forces of death and undeath. Almost aany non-evil deity can claim influence over this domain, particularly agricultural deities (such as Chauntea, Arawai, and Demeter), sun gods (such as Lathander, Pelor, and Re-Horakhty), gods of healing or endurance (such as Ilmater, Mishakal, Apollo, and Dianccecht), and gods of home and community (such as Hestia, Hathor, and Bolderi).",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Life Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureLifeDomainSpells",
    "name": "Life Domain Spells",
    "content": [],
    "description": "You gain the following spells at the indicated Cleric level. Once you gain these spells they are always prepared and don't count against your daily limit. If the spell isn't on the cleric spell list it is nonetheless a cleric spell for you./n1st level: bless, cure wounds/n3rd level: lesser restoration, spiritual weapon/n5th level: beacon of hope, revivify/n7th level: death ward, guardian of faith/n9th level: mass cure wounds, raise dead",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Life Domain"
    ],
    "levelingInfo": [
      [
        "spellBless",
        "spellCureWounds"
      ],
      [],
      [
        "spellLesserRestoration",
        "spellSpiritualWeapon"
      ],
      [],
      [
        "spellBeaconOfHope",
        "spellRevivify"
      ],
      [],
      [
        "spellDeathWard",
        "spellGuardianOfFaith"
      ],
      [],
      [
        "spellMassCureWounds",
        "spellRaiseDead"
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      []
    ]
  },
  {
    "id": "featureBonusProficiencyLifeDomain",
    "name": "Bonus Proficiency",
    "content": [],
    "description": "When you choose this domain at 1st level, you gain proficiency with heavy armror.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Life Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureDiscipleOfLife",
    "name": "Disciple of Life",
    "content": [],
    "description": "Also starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell's level.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Life Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureChannelDivinityPreserveLife",
    "name": "Channel Divinity: Preserve Life",
    "content": [],
    "description": "Starting at 2nd level, you can use your Channel Divinity to heal the badly injured./nAs an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can't use this feature on an undead or construct.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Life Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureBlessedHealer",
    "name": "Blessed Healer",
    "content": [],
    "description": "Beginning at 6th level, the healing spells you cast on others heal you as well. When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell's level.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Life Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureDivineStrikeLifeDomain",
    "name": "Divine Strike",
    "content": [],
    "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Life Domain"
    ],
    "levelingInfo": [
      [
        "Radiant Damage Bonus: ",
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8"
      ]
    ]
  },
  {
    "id": "featureSupremeHealing",
    "name": "Supreme Healing",
    "content": [],
    "description": "Starting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest nubmer possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Life Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureLightDomain",
    "name": "Light Domain",
    "content": [
      "featureLightDomainSpells",
      "featureBonusCantripLightDomain",
      "featureWardingFlare",
      "featureChannelDivinityRadianceOfTheDawn",
      "featureImprovedFlare",
      "featurePotentSpellcasting",
      "featureCoronaOfLight"
    ],
    "description": "Gods of light-including Helm, Lathander, Pholtus, Branchala, the Silver Flame, Belenus, Apollo, and Re-Horakhty- promote of rebirth and renewal, truth, vigilance, and beauty, often using the symbol of the sun. Some of these gods portrayed as the sun itself or as a charioteer who guides the sun across the sky. Others are tireless sentinels whose eyes pierce every shadow and see through every deception. Some are deities of beauty and artistry, who teach that art is a vehicle for the soul's improvement. Clerics of a god of light are enlightened souls infused with radiance and the power of their gods' discerning vision, charged with chasing away lies and burning away darkness.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Light Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureLightDomainSpells",
    "name": "Light Domain Spells",
    "content": [],
    "description": "You gain the following spells at the indicated Cleric level. Once you gain these spells they are always prepared and don't count against your daily limit. If the spell isn't on the cleric spell list it is nonetheless a cleric spell for you./n1st level: burning hands, faerie fire/n3rd level: flaming sphere, scorching ray/n5th level: daylight, fireball/n7th level: gaurdian of faith, wall of fire/n9th level: flame strike, scrying",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Light Domain"
    ],
    "levelingInfo": [
      [
        "spellBurningHands",
        "spellFaerieFire"
      ],
      [],
      [
        "spellFlamingSphere",
        "spellScorchingRay"
      ],
      [],
      [
        "spellDaylight",
        "spellFireball"
      ],
      [],
      [
        "spellGuardianOfFaith",
        "spellWallOfFire"
      ],
      [],
      [
        "spellFlameStrike",
        "spellScrying"
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      []
    ]
  },
  {
    "id": "featureBonusCantripLightDomain",
    "name": "Bonus Cantrip",
    "content": [
      "spellLight"
    ],
    "description": "When you choose this domain at 1st level, you gain the light cantrip if you don't already know it.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Light Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureWardingFlare",
    "name": "Warding Flare",
    "content": [],
    "description": "Also at 1st level, you can interpose divine light between yourself and an attacking enemy. When you are attacked by a creature within 30 feet of you that you can see, you can use your reaction to impose disadvantage on the attack roll, causing light to flare before the attacker before it hits or misses. An attacker that can't be blinded is immune to this feature./nYou can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Light Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureChannelDivinityRadianceOfTheDawn",
    "name": "Channel Divinity: Radiance of the Dawn",
    "content": [],
    "description": "Starting at 2nd level, you can use your Channel Divinity to harness sunlight, banishing darkness and dealing radiant damage to your foes./nAs an action, you present your holy symbol, and any magical darkness within 30 feet of you is dispelled. Additionally, each hostile creature within 30 feet of you must make a Constitution saving throw. A creature takes radiant damage equal to 2d10 + your cleric level on a failed saving throw, and half as much damage on a successful one. A creature that has total cover from you id not affected.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureImprovedFlare",
    "name": "Improved Flare",
    "content": [],
    "description": "Starting at 6th level, you can also use your Warding Flare feature when a creature that you can see within 30 feet of you attacks a creature other than you.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Light Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureCoronaOfLight",
    "name": "Corona of Light",
    "content": [],
    "description": "Starting at 17th level, you canuse your action to activate an aura of sunlight that lasts for 1 minute or until you dismiss it using another action. You emit bright light in a 60-foot radius and dim light 30 feet beyond that. Your enemies in the bright light have disadvantage on saving throws against any spell that deals fire or radiant damage.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Light Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureNatureDomain",
    "name": "Nature Domain",
    "content": [
      "featureNatureDomainSpells",
      "featureAcolyteOfNature",
      "featureBonusProficiencyNatureDomain",
      "featureChannelDivinityCharmAnimalsAndPlants",
      "featureDampenElements",
      "featureDivineStrikeNatureDomain",
      "featureMasterOfNature"
    ],
    "description": "Gods of nature are as varied as the natural world itself, from inscrutable gods of the deep forests (such as Silvanus, Obad-Hai, Chislev, Balinor, and Pan) to friendly deities associated with particualr springs and groves (such as Eldath), Druids revere nature as a whole and might serve one of these deities, practicing mysterious rites and reciting all-but-forgotten prayers in their own secret tongue. But many of these gods have clerics as well, champions who take a more active role in advancing the interests of a particular nature god. These clerics might hunt the evil monstrosities that despoil the woodlands, bless the harvest of the faithful, or wither the crops of those who anger their gods.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Nature Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureNatureDomainSpells",
    "name": "Nature Domain Spells",
    "content": [],
    "description": "You gain the following spells at the indicated Cleric level. Once you gain these spells they are always prepared and don't count against your daily limit. If the spell isn't on the cleric spell list it is nonetheless a cleric spell for you./n1st level: animal friendship, speak with animals/n3rd level: barkskin, spike growth/n5th level: plant growth, wind wall/n7th level: dominate beast, grasping vine/n9th level: insect plague, tree stride",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Nature Domain"
    ],
    "levelingInfo": [
      [
        "spellAnimalFriendship",
        "spellSpeakWithAnimals"
      ],
      [],
      [
        "spellBarkskin",
        "spellSpikeGrowth"
      ],
      [],
      [
        "spellPlantGrowth",
        "spellWindWall"
      ],
      [],
      [
        "spellDominateBeast",
        "spellGraspingVine"
      ],
      [],
      [
        "spellInsectPlague",
        "spellTreeStride"
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      []
    ]
  },
  {
    "id": "featureAcolyteOfNature",
    "name": "Acolyte of Nature",
    "content": [],
    "description": "At  1st level, you learn one druid cantrip of your choice. You also gain proficiency in one of the following skills of your choice: Animal Handling, Nature, or Survival.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Nature Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureBonusProficiencyNatureDomain",
    "name": "Bonus Proficiency",
    "content": [],
    "description": "When you choose this domain at 1st level, you gain proficiency with heavy armror.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Nature Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureChannelDivinityCharmAnimalsAndPlants",
    "name": "Channel Divinity: Charm Animals and Plants",
    "content": [],
    "description": "Starting at 2nd level, you can use your Channel Divinity to charm animals and plants./nAs an action, you present your holy symbol and invoke the name of your deity. Each beast or plant creature that can see you within 30 feet of you must make a Wisdome saving throw. If the creature fails its saving throw, it is charmed by you for 1 minute or until it takes damage. While it is charmed by you, it is friendly to you and other creatures you designate.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Nature Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureDampenElements",
    "name": "Dampen Elements",
    "content": [],
    "description": "Starting at 6th level, when you or a creature within 30 feet of you takes acid, cold, fire, lightning, or thunder damage, you can use your reaction to grant resistance to the creature against that instance of the damage.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Nature Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureDivineStrikeNatureDomain",
    "name": "Divine Strike",
    "content": [],
    "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 cold, fire, or lightning damage (your choice) to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Nature Domain"
    ],
    "levelingInfo": [
      [
        "Elemental Damage Bonus: ",
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8"
      ]
    ]
  },
  {
    "id": "featureMasterOfNature",
    "name": "Master of Nature",
    "content": [],
    "description": "At 17th level, you gain the ability to command aniimals and plant creatures. While creatures are charmed by your Charm Animals and Plants feature, you can take a bonus action on your turn to verbally command what each of those creatures will do on its next turn.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Nature Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTempestDomain",
    "name": "Tempest Domain",
    "content": [
      "featureTempestDomainSpells",
      "featureBonusProficienciesTempestDomain",
      "featureWrathOfTheStorm",
      "featureChannelDivinityDestructiveWrath",
      "featureThunderboltStrike",
      "featureDivineStrikeTempestDomain",
      "featureStormborn"
    ],
    "description": "Gods whose portfolios include the Tempest domain-including Talos, Umberlee, Kord, Zeboim, the Devourer, Zeus, and Thor-govern storms, sea, and sky. They include gods of lightning and thunder, gods of earthquakes, some fire gods and certain gods of violence, physical strength, and courage. In some pantheons, a god of this domain rules over other deities and is known for swift justice delivered by thunderbolts. In the pantheons of seafaring people, gods of this domain are oceandeities and the patros of sailors. Tempest gods send their clerics to inspire fear in the common folk, either to keep those folk on the path of righteousness or to encourage them to offer sacrifices of propitation to ward off divine wrath.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Tempest Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTempestDomainSpells",
    "name": "Tempest Domain Spells",
    "content": [],
    "description": "You gain the following spells at the indicated Cleric level. Once you gain these spells they are always prepared and don't count against your daily limit. If the spell isn't on the cleric spell list it is nonetheless a cleric spell for you./n1st level: fog cloud, thunderwave/n3rd level: gust of wind, shatter/n5th level: call lightning, sleet storm/n7th level: control water, ice storm/n9th level: destructive wave, insect plague",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Tempest Domain"
    ],
    "levelingInfo": [
      [
        "spellFogCloud",
        "spellThunderwave"
      ],
      [],
      [
        "spellGustOfWind",
        "spellShatter"
      ],
      [],
      [
        "spellCallLightning",
        "spellSleetStorm"
      ],
      [],
      [
        "spellControlWater",
        "spellIceStorm"
      ],
      [],
      [
        "spellDestructiveWave",
        "spellInsectPlague"
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      []
    ]
  },
  {
    "id": "featureBonusProficienciesTempestDomain",
    "name": "Bonus Proficiencies",
    "content": [],
    "description": "At 1st level, you gain proficiency with martial weapons and heavy armor.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Tempest Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureWrathOfTheStorm",
    "name": "Wrath of the Storm",
    "content": [],
    "description": "Also at 1st level, you can thunderously rebuke attackers. When a creature within 5 feet of you that you can see hits you with an attack, you can use your reaction to cause the creature to make a Dexterity saving throw. The creature takes 2d8 lightning or thunder damage (your choice) on a failed saving throw, and half as much damage on a successful one./nYou can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Tempest Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureChannelDivinityDestructiveWrath",
    "name": "Channel Divinity: Destructive Wrath",
    "content": [],
    "description": "Starting at 2nd level, you can use your Channel Divinity to weild the power of the storm with unchecked ferocity./nWhen you roll lightning or thunder damage, you can use your Channel Divinity to deal maximum damage instead of rolling.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Tempest Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureThunderboltStrike",
    "name": "Thunderbolt Strike",
    "content": [],
    "description": "At 6th level, when you deal lightning damage to a Large or smaller creature, you can also push it 10 feet away from you.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Tempest Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureDivineStrikeTempestDomain",
    "name": "Divine Strike",
    "content": [],
    "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Tempest Domain"
    ],
    "levelingInfo": [
      [
        "Thunder Damage Bonus: ",
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8"
      ]
    ]
  },
  {
    "id": "featureStormborn",
    "name": "Stormborn",
    "content": [],
    "description": "At 17th level, you have a flying speed equal to your current wlaking speed whenever you aqre not underground or indoors.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Tempest Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTrickeryDomain",
    "name": "Trickery Domain",
    "content": [
      "featureTrickeryDomainSpells",
      "featureBlessingOfTheTrickster",
      "featureChannelDivinityInvokeDuplicity",
      "featureChannelDivinityCloakOfShadows",
      "featureDivineStrikeTrickeryDomain",
      "featureImprovedDuplicity"
    ],
    "description": "Gods of trickery-such as Tymora, Beshaba, Olidammara, the Traveler, Garl Glittergold, and Loki-are mischief-makers and instigators who stand as a constant challenge to the accepted order among both gods and mortals. They're patrons of theives, scoundrels, gamblers, rebels, and liberators. Their clerics are a  disruptive force in the world, puncturing pride, mocking tyrants, stealing from the rich, freeing captives, and flouting hollow traditions. They prefer subterfuge, pranks, deception, and theft rather than direct confrontation.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Trickery Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTrickeryDomainSpells",
    "name": "Trickery Domain Spells",
    "content": [],
    "description": "You gain the following spells at the indicated Cleric level. Once you gain these spells they are always prepared and don't count against your daily limit. If the spell isn't on the cleric spell list it is nonetheless a cleric spell for you./n1st level: charm person, disguise self/n3rd level: mirror image, pass without trace/n5th level: blink, dispel magic/n7th level: dimension door, polymorph/n9th level: dominate person, modify memory",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Trickery Domain"
    ],
    "levelingInfo": [
      [
        "spellCharmPerson",
        "spellDisguiseSelf"
      ],
      [],
      [
        "spellMirrorImage",
        "spellPassWithoutTrace"
      ],
      [],
      [
        "spellBlink",
        "spellDispelMagic"
      ],
      [],
      [
        "spellDimensionDoor",
        "spellPolymorph"
      ],
      [],
      [
        "spellDominatePerson",
        "spellModifyMemory"
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      []
    ]
  },
  {
    "id": "featureBlessingOfTheTrickster",
    "name": "Blessing of the Trickster",
    "content": [],
    "description": "Starting when you choose this domain at 1st level, you can use your action to touch a willing creature other than yourself to give it advantage on Dexterity(Stealth) checks. This blessing lasts for 1 hour or until you use thiss feature again.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Trickery Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureChannelDivinityInvokeDuplicity",
    "name": "Channel Divinity: Invoke Duplicity",
    "content": [],
    "description": "Starting at 2nd level, you can use your Channel Divinity to create an illusory duplicate of yourself./nAs an action, you create a perfect illusion of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentrating on a spell). The illusion appears in an unoccupied space that you can see within 30 feet of you. As a bonus action on your turn, you can move the illusion up to 30 feet to a space you can see, but it must remain within 120 feet of you./nFor the duration, you can cast spells as though you were in hte illusion's space, but you must use your own senses. Additionally, when both you and your illusion are within 5 feet of a creature that can see the illusion, you have advantage on attack rolls against that creature, given how distracting the illusion is to the target.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Trickery Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureChannelDivinityCloakOfShadows",
    "name": "Channel Divinity: Cloak of Shadows",
    "content": [],
    "description": "Starting at 6th level, you can use your Channel Divinity to vanish./nAs an action, you become invisible until the end of your next turn. You become visible if you attack or cast a spell.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Trickery Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureDivineStrikeTrickeryDomain",
    "name": "Divine Strike",
    "content": [],
    "description": "At 8th level, you gain the ability to infuse your weapon strikes with poison-a gift from your deity. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 poison damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Trickery Domain"
    ],
    "levelingInfo": [
      [
        "Poison Damage Bonus: ",
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8"
      ]
    ]
  },
  {
    "id": "featureImprovedDuplicity",
    "name": "Improved Duplicity",
    "content": [],
    "description": "At 17th level, you can create up to four duplicates of yourself, instead of one, when you use Invoke Duplicity. As a bonus action on your turn, you can move any number of them up to 30 feet, to a maximum range of 120 feet.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "Trickery Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureWarDomain",
    "name": "War Domain",
    "content": [
      "featureWarDomainSpells",
      "featureBonusProficienciesWarDomain",
      "featureWarPriest",
      "featureChannelDivinityGuidedStrike",
      "featureChannelDivinityWarGodsBlessing",
      "featureDivineStrikeWarDomain",
      "featureAvatarOfBattle"
    ],
    "description": "War has many manifestations. It can make heroes of ordinary people. It can be desparate and horrific, with acts of cruelty and cowardice eclipsing instances of excellence and courage. In either case, the gods of war watch over warriors and reward them for their great deeds. The clerics of such gods excel in battle, inspiring others to fight the good fight or offerinc acts of violence as prayers. Gods of war include champions of honor and chivalry (such as Torm, Heironeous, and Kiri-Jolith) as well as gods of destruction and pillage (such as Erythnul, the Fury, Gruumsh, and Ares) and gods of conquest and domination (such as Bane, Hextor, and Maglubiyet). Other war gods (such as Tempus, Nike, and Nuada) take a more neutral stance, promoting war in all its manifestations and supporting warriors in any circumstance.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "War Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureWarDomainSpells",
    "name": "War Domain Spells",
    "content": [],
    "description": "You gain the following spells at the indicated Cleric level. Once you gain these spells they are always prepared and don't count against your daily limit. If the spell isn't on the cleric spell list it is nonetheless a cleric spell for you./n1st level: divine favor, shield of faith/n3rd level: magic weapon, spiritual weapon/n5th level: crusader's mantle, spirit guardians/n7th level: freedom of movement, stoneskin/n9th level: flame strike, hold monster",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "War Domain"
    ],
    "levelingInfo": [
      [
        "spellDivineFavor",
        "spellShieldOfFaith"
      ],
      [],
      [
        "spellMagicWeapon",
        "spellSpiritualWeapon"
      ],
      [],
      [
        "spellCrusadersMantle",
        "spellSpiritGuardians"
      ],
      [],
      [
        "spellFreedomOfMovement",
        "spellStoneskin"
      ],
      [],
      [
        "spellFlameStrike",
        "spellHoldMonster"
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      []
    ]
  },
  {
    "id": "featureBonusProficienciesWarDomain",
    "name": "Bonus Proficiencies",
    "content": [],
    "description": "At 1st level, you gain proficiency with martial weapons and heavy armor.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "War Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureWarPriest",
    "name": "War Priest",
    "content": [],
    "description": "From 1st level, your god delivers bolts of inspiration to you while you are engaged in battle. When you use the Attack action, you can make one weapon attack as a bonus action./nYou can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "War Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureChannelDivinityGuidedStrike",
    "name": "Channel Divinity: Guided Strike",
    "content": [],
    "description": "Starting at 2nd level, you can use your Channel Divinity to strike with supernatural accuracy. When you make an attack roll you can use your Channel Divinity to gain a +10 bonus to the roll. You must make this choice after you see the roll, but before the DM says whether the attack hits or misses.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "War Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureChannelDivinityWarGodsBlessing",
    "name": "Channel Divinity: War God's Blessing",
    "content": [],
    "description": "At 6th level, when a creature within 30 feet of you makes an attack roll, you can use your reaction to grant that creature a +10 bonus to the roll, using your Channel Divinity. You make this choice after you see the roll, but before the DM says whether the attack hits or misses.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "War Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureDivineStrikeWarDomain",
    "name": "Divine Strike",
    "content": [],
    "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "War Domain"
    ],
    "levelingInfo": [
      [
        "Weapon Damage Bonus: ",
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8",
        "2d8"
      ]
    ]
  },
  {
    "id": "featureAvatarOfBattle",
    "name": "Avatar of Battle",
    "content": [],
    "description": "At 17th level, you gain resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric",
      "War Domain"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureChannelDivinityTurnUndead",
    "name": "Channel Divinity: Turn Undead",
    "content": [],
    "description": "At 2nd level, you gasin the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description./nWhen you use your Channel Divinity, you choose which effect to create. You must then complete a short or long rest to use your Channel Divinity again./nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC./nBeginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric"
    ],
    "levelingInfo": [
      [
        "Number of Channel Divinity uses: ",
        "1",
        "1",
        "1",
        "1",
        "1",
        "2",
        "2",
        "2",
        "2",
        "2",
        "2",
        "2",
        "2",
        "2",
        "2",
        "2",
        "2",
        "3",
        "3",
        "3"
      ]
    ]
  },
  {
    "id": "featureDestroyUndead",
    "name": "Destroy Undead",
    "content": [],
    "description": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureDivineIntervention",
    "name": "Divine Intervention",
    "content": [],
    "description": "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great./nImploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate./nIf your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest./nAt 20th level, your call for intervention succeeds automatically, no roll required.",
    "classes": [
      "Cleric"
    ],
    "tags": [
      "Cleric"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureSpellcastingDruid",
    "name": "Druid Spellcasting",
    "content": [
      "spellDruidcraft",
      "spellGuidance",
      "spellMending",
      "spellPoisonSpray",
      "spellProduceFlame",
      "spellResistance",
      "spellShillelagh",
      "spellThornWhip",
      "spellAnimalFriendship",
      "spellCharmPerson",
      "spellCreateOrDestroyWater",
      "spellCureWounds",
      "spellDetectMagic",
      "spellDetectPoisonAndDisease",
      "spellEntangle",
      "spellFaerieFire",
      "spellFogCloud",
      "spellGoodberry",
      "spellHealingWord",
      "spellJump",
      "spellLongstrider",
      "spellPurifyFoodAndDrink",
      "spellSpeakWithAnimals",
      "spellThunderwave",
      "spellAnimalMessenger",
      "spellBarkskin",
      "spellBeastSense",
      "spellDarkvision",
      "spellEnhanceAbility",
      "spellFindTraps",
      "spellFlameBlade",
      "spellFlamingSphere",
      "spellGustOfWind",
      "spellHeatMetal",
      "spellHoldPerson",
      "spellLesserRestoration",
      "spellLocateAnimalsOrPlants",
      "spellLocateObject",
      "spellMoonbeam",
      "spellPassWithoutTrace",
      "spellProtectionFromPoison",
      "spellSpikeGrowth",
      "spellCallLightning",
      "spellConjureAnimals",
      "spellDaylight",
      "spellDispelMagic",
      "spellFeignDeath",
      "spellMeldIntoStone",
      "spellPlantGrowth",
      "spellProtectionFromEnergy",
      "spellSleetStorm",
      "spellSpeakWithPlants",
      "spellWaterBreathing",
      "spellWaterWalk",
      "spellWindWall",
      "spellBlight",
      "spellConfusion",
      "spellConjureMinorElementals",
      "spellConjureWoodlandBeings",
      "spellControlWater",
      "spellDominateBeast",
      "spellFreedomOfMovement",
      "spellGiantInsect",
      "spellGraspingVine",
      "spellHallucinatoryTerrain",
      "spellIceStorm",
      "spellLocateCreature",
      "spellPolymorph",
      "spellStoneShape",
      "spellStoneskin",
      "spellWallOfFire",
      "spellAntilifeShell",
      "spellAwaken",
      "spellCommuneWithNature",
      "spellConjureElemental",
      "spellContagion",
      "spellGeas",
      "spellGreaterRestoration",
      "spellInsectPlague",
      "spellMassCureWounds",
      "spellPlanarBinding",
      "spellReincarnate",
      "spellScrying",
      "spellTreeStride",
      "spellWallOfStone",
      "spellConjureFey",
      "spellFindThePath",
      "spellHeal",
      "spellHeroesFeast",
      "spellMoveEarth",
      "spellSunbeam",
      "spellTransportViaPlants",
      "spellWallOfThorns",
      "spellWindWalk",
      "spellFireStorm",
      "spellMirageArcane",
      "spellPlaneShift",
      "spellRegenerate",
      "spellReverseGravity",
      "spellAnimalShapes",
      "spellAntipathySympathy",
      "spellControlWeather",
      "spellEarthquake",
      "spellFeeblemind",
      "spellSunburst",
      "spellTsunami",
      "spellForesight",
      "spellShapechange",
      "spellStormOfVengeance",
      "spellTrueResurrection"
    ],
    "description": "Drawing on the divine essence of nature itself, you can case spells to hsape the essence at your will./nSpell Save DC = 8 + your proficiency bonus + your Wisdom modifier/nSpell attack modifier = your proficiency bonus + your Wisdom modifier",
    "classes": [
      "Druid"
    ],
    "tags": [
      "Druid",
      "Spellcasting"
    ],
    "levelingInfo": [
      [
        "2",
        "2",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "2",
        "3",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "2",
        "4",
        "2",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "4",
        "3",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "4",
        "3",
        "2",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "4",
        "3",
        "3",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "4",
        "3",
        "3",
        "1",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "4",
        "3",
        "3",
        "2",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "4",
        "3",
        "3",
        "3",
        "1",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "3",
        "2",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "3",
        "3",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1"
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "3",
        "3",
        "2",
        "2",
        "1",
        "1"
      ]
    ]
  },
  {
    "id": "featureDruidic",
    "name": "Druidic",
    "content": [],
    "description": "You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message's presence witha successful DC 15 Wisdom(Perception) check but can't decipher it without magic.",
    "classes": [
      "Druid"
    ],
    "tags": [
      "Druid"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureWildShape",
    "name": "Wild Shape",
    "content": [],
    "description": "Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long reast./nYour druid level determines the beasts you can transform into./nYou can stay in a beast shape for a number of hours equal to hald your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die./nWhile you are transformed, the following rules apply:/n-Your game statistics are replaces by the statistics of the beast, but you retain your alignment, personality, Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its statblock is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them./n-When you transform, you assume the beast's hit points and Hit Dice. Whe nyou revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit pointds, you aren't knocked unconscious./n-You can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as call lightning, that you've arleady cast./n-You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as darkvision, unless your new form also has that sense./n-You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. Equipment that mergers with the form has no effect until you leave the form.",
    "classes": [
      "Druid"
    ],
    "tags": [
      "Druid"
    ],
    "levelingInfo": [
      [],
      [
        "Max CR: 1/4",
        "Limitations - No flying or swimming speed"
      ],
      [
        "Max CR: 1/4",
        "Limitations - No flying or swimming speed"
      ],
      [
        "Max CR: 1/2",
        "Limitations - No flying speed"
      ],
      [
        "Max CR: 1/2",
        "Limitations - No flying speed"
      ],
      [
        "Max CR: 1/2",
        "Limitations - No flying speed"
      ],
      [
        "Max CR: 1/2",
        "Limitations - No flying speed"
      ],
      [
        "Max CR: 1",
        "Limitations - None"
      ],
      [
        "Max CR: 1",
        "Limitations - None"
      ],
      [
        "Max CR: 1",
        "Limitations - None"
      ],
      [
        "Max CR: 1",
        "Limitations - None"
      ],
      [
        "Max CR: 1",
        "Limitations - None"
      ],
      [
        "Max CR: 1",
        "Limitations - None"
      ],
      [
        "Max CR: 1",
        "Limitations - None"
      ],
      [
        "Max CR: 1",
        "Limitations - None"
      ],
      [
        "Max CR: 1",
        "Limitations - None"
      ],
      [
        "Max CR: 1",
        "Limitations - None"
      ],
      [
        "Max CR: 1",
        "Limitations - None"
      ],
      [
        "Max CR: 1",
        "Limitations - None"
      ],
      [
        "Max CR: 1",
        "Limitations - None"
      ]
    ]
  },
  {
    "id": "featureDruidCircle",
    "name": "Druid Circle",
    "content": [
      "featureCircleOfTheLand",
      "CircleOfTheMoon"
    ],
    "description": "At 2nd level, you choose to identify with a circle of druids: the Circle of the Land or the Circle of the Moon, both detailed at the end of the class description. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level.",
    "classes": [
      "Druid"
    ],
    "tags": [
      "Druid",
      "Druid Circle",
      "Circle of the Land",
      "Circle of the Moon"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featurefeatureCircleOfTheLand",
    "name": "Circle of the Land",
    "content": [
      "featureBonusCantripDruid",
      "featureNaturalRecovery",
      "featureCircleSpells",
      "featureLandsStride",
      "featureNaturesWard",
      "featureNaturesSanctuary"
    ],
    "description": "The Circle of the Land is made up of mystics and sages who safeguard ancient knowledge and rites through a vast oral tradition. These druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic. The circle's wisest members preside as the chief priests of communities that hold to the Old Faith and serve as advisors to the rulers of those folk. As a member of this circle, your magic is influenced by the land where you were initiated into the circle's mysterious rites.",
    "classes": [
      "Druid"
    ],
    "tags": [
      "Druid",
      "Druid Circle",
      "Circle of the Land"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureBonusCantripDruid",
    "name": "Bonus Cantrip",
    "content": [],
    "description": "When you choose this circle at 2nd level, you learn one additional druid cantrip of your choice.",
    "classes": [
      "Druid"
    ],
    "tags": [
      "Druid",
      "Circle of the Land"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureNaturalRecovery",
    "name": "Natural Recovery",
    "content": [],
    "description": "Starting at 2nd level, you can regain some of your magical energy by sitting in meditation and communing with nature. During a short rest, you choose expended spell slotsto recover. The spell slots can have a combined level that is equal to or less than half your druid level (rounded up), and none of the slots can be 6th level or higher. You can't use this feature again until you finish a long rest./nFor example, when you are a 4th-level druid, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level slot or two 1st-level slots.",
    "classes": [
      "Druid"
    ],
    "tags": [
      "Druid",
      "Circle of the Land"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureCircleOfTheMoon",
    "name": "Circle of the Moon",
    "content": [],
    "description": "",
    "classes": [
      "Druid"
    ],
    "tags": [
      "Druid",
      "Druid Circle",
      "Circle of the Moon"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTimelessBody",
    "name": "Timeless Body",
    "content": [],
    "description": "Starting at 18th level, the primal magic that you weild causes you to age mroe slowly. For every 10 years that pass, your body ages only 1 year.",
    "classes": [
      "Druid"
    ],
    "tags": [
      "Druid"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureBeastSpells",
    "name": "Beast Spells",
    "content": [],
    "description": "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren't able to provide material components.",
    "classes": [
      "Druid"
    ],
    "tags": [
      "Druid"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureArchdruid",
    "name": "Archdruid",
    "content": [],
    "description": "At 20th level, you can use your Wild Shape an unlimited number of times.",
    "classes": [
      "Druid"
    ],
    "tags": [
      "Druid"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureFightingStyle",
    "name": "Fighting Style",
    "content": [
      "featureArchery",
      "featureDefense",
      "featureDueling",
      "featureGreatWeaponFighting",
      "featureProtection",
      "featureTwoWeaponFighting"
    ],
    "description": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again. The options are Archery, Defense, Dueling, Great Weapon Fighting, Protection, Two-Weapon Fighting.",
    "classes": [
      "fighter"
    ],
    "tags": [
      "Fighter"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureArchery",
    "name": "Fighting Style: Archery",
    "content": [],
    "description": "You gain a +2 bonus to attack rolls you make with ranged weapons.",
    "classes": [
      "fighter"
    ],
    "tags": [
      "Fighter"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureDefense",
    "name": "Fighting Style: Defense",
    "content": [],
    "description": "While you are wearing armor, you gain a +1 bonus to AC.",
    "classes": [
      "fighter"
    ],
    "tags": [
      "Fighter"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureDueling",
    "name": "Fighting Style: Dueling",
    "content": [],
    "description": "When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus on damage rolls with that weapon.",
    "classes": [
      "fighter"
    ],
    "tags": [
      "Fighter"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureGreatWeaponFighting",
    "name": "Fighting Style: Great Weapon Fighting",
    "content": [],
    "description": "When you roll a 1 or 2 on a damage die for an attack you make wiht a melee weapon that you are wielding with two handes, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit.",
    "classes": [
      "fighter"
    ],
    "tags": [
      "Fighter"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureProtection",
    "name": "Fighting Style: Protection",
    "content": [],
    "description": "When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.",
    "classes": [
      "fighter"
    ],
    "tags": [
      "Fighter"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTwoWeaponFighting",
    "name": "Fighting Style: Two-Weapon Fighting",
    "content": [],
    "description": "When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.",
    "classes": [
      "fighter"
    ],
    "tags": [
      "Fighter"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureSecondWind",
    "name": "Second Wind",
    "content": [],
    "description": "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level./nOnce you use this feature, you must finish a short or long rest before you can use it again.",
    "classes": [
      "fighter"
    ],
    "tags": [
      "Fighter"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureMartialArts",
    "name": "Martial Arts",
    "content": [],
    "description": "At 1st level, your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don't have the two-handed or heavy property./nYou gain the following benefits while you are unarmed or wielding only monk weapons and you aren't wearing armor or wielding a shield:/n-You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons./n-You can roll a d4 in place of the normal damage your unarmed strike or monk weapon. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table./n-When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven't already taken a bonus action this turn./nCertain monestaries use specialized forms of the monk weapons. For example, you might use a club that is two lengths of wood connected by a short chain (called nunchaku) or a sickle with a shorter, straighter blade (called a kama). Whatever name you use for a monk weapon, you can use the game statistics p[rovided for the weapon in chapter 5.",
    "classes": [
      "Monk"
    ],
    "tags": [
      "Monk"
    ],
    "levelingInfo": [
      [
        "1d4",
        "1d4",
        "1d4",
        "1d4",
        "1d6",
        "1d6",
        "1d6",
        "1d6",
        "1d6",
        "1d6",
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "1d8",
        "1d10",
        "1d10",
        "1d10",
        "1d10"
      ]
    ]
  },
  {
    "id": "featureDivineSense",
    "name": "Divine Sense",
    "content": [],
    "description": "THe presence of strong evil registers on your senses like a noxious odor, and a powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, undead) of any being whose presence you can sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell./nYou can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses.",
    "classes": [
      "Paladin"
    ],
    "tags": [
      "Paladin"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureLayOnHands",
    "name": "Lay on Hands",
    "content": [],
    "description": "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hitpoints equal to your paladin level x 5./nAs an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool./nAlternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one./nThis feature has no effect on undead and constructs.",
    "classes": [
      "Paladin"
    ],
    "tags": [
      "Paladin"
    ],
    "levelingInfo": [
      [
        "5",
        "10",
        "15",
        "20",
        "25",
        "30",
        "35",
        "40",
        "45",
        "50",
        "55",
        "60",
        "65",
        "70",
        "75",
        "80",
        "85",
        "90",
        "95",
        "100"
      ]
    ]
  },
  {
    "id": "featureFavoredEnemy",
    "name": "Favored Enemy",
    "content": [],
    "description": "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy./nChoose a type of favored enemy: abberations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies./nYou have advantage on Wisdom(Survival) checks to track your favored enemies, as well as aon Intelligence checks to recall information about them./nWhen you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all./nYou choose one additional favored enemy, as well as an associated language, at 6th and 14th level. As you gain levels, your choices should reflect the types of monsters you have encountered on your adventures.",
    "classes": [
      "Ranger"
    ],
    "tags": [
      "Ranger"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureNaturalExplorer",
    "name": "Natural Explorer",
    "content": [],
    "description": "You are particularly familiar with one type of natural encironment and are adept at traveling and surviving in such regions. Choose one type of favorfed terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you're proficient in./nWhile traveling for an hour or more in your favored terrain, ou gain the following benefits:/n-Difficult terrain doesn't slow your group's travel./n-Your group can't become lost except by magical means./n-Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger./n-When you forage, you find twice as much food as you normally would./n-While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area./nYou choose additional favored terrain types at 6th and 10th level.",
    "classes": [
      "Ranger"
    ],
    "tags": [
      "Ranger"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureExpertiseRogue",
    "name": "Expertise",
    "content": [],
    "description": "At 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves' tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies./nAt 6th level, you can choose two more of your proficiencies (in skills or with thieves' tools) to gain this benefit.",
    "classes": [
      "Rogue"
    ],
    "tags": [
      "Rogue"
    ],
    "levelingInfo": [
      [
        "2",
        "",
        "",
        "",
        "",
        "2",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    ]
  },
  {
    "id": "featureSneakAttack",
    "name": "Sneak Attack",
    "content": [],
    "description": "Beginning at 1st level, you know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or ranged weapon./nThe amount of the extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table.",
    "classes": [
      "Rogue"
    ],
    "tags": [
      "Rogue"
    ],
    "levelingInfo": [
      [
        "1d6",
        "1d6",
        "2d6",
        "2d6",
        "3d6",
        "3d6",
        "4d6",
        "4d6",
        "5d6",
        "5d6",
        "6d6",
        "6d6",
        "7d6",
        "7d6",
        "8d6",
        "8d6",
        "9d6",
        "9d6",
        "10d6",
        "10d6"
      ]
    ]
  },
  {
    "id": "featureThievesCant",
    "name": "",
    "content": [],
    "description": "During your rogue training you learned thieves' cant, a secret mix of dialect, jargo, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves' cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly./nIn addition, you understand  a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves' guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run.",
    "classes": [
      "Rogue"
    ],
    "tags": [
      "Rogue"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureSpellcastingSorcerer",
    "name": "Sorcerer Spellcasting",
    "content": [
      "spellAcidSplash",
      "spellBladeWard",
      "spellChillTouch",
      "spellDancingLights",
      "spellFireBolt",
      "spellFriends",
      "spellMageHand",
      "spellMending",
      "spellMessage",
      "spellMinorIllusion",
      "spellPoisonSpray",
      "spellPrestidigitation",
      "spellRayOfFrost",
      "spellShockingGrasp",
      "spellTrueStrike",
      "spellBurningHands",
      "spellCharmPerson",
      "spellChromaticOrb",
      "spellColorSpray",
      "spellComprehendLanguages",
      "spellDetectMagic",
      "spellDisguiseSelf",
      "spellExpeditiousRetreat",
      "spellFalseLife",
      "spellFeatherFall",
      "spellFogCloud",
      "spellJump",
      "spellMageArmor",
      "spellMagicMissile",
      "spellRayOfSickness",
      "spellShield",
      "spellSilentImage",
      "spellSleep",
      "spellThunderwave",
      "spellWitchBolt",
      "spellAlterSelf",
      "spellBlindnessDeafness",
      "spellBlur",
      "spellCloudOfDaggers",
      "spellCrownOfMadness",
      "spellDarkness",
      "spellDarkvision",
      "spellDetectThoughts",
      "spellEnhanceAbility",
      "spellEnlargeReduce",
      "spellGustOfWind",
      "spellHoldPerson",
      "spellInvisibility",
      "spellKnock",
      "spellLevitate",
      "spellMirrorImage",
      "spellMistyStep",
      "spellPhantasmalForce",
      "spellScorchingRay",
      "spellSeeInvisibility",
      "spellShatter",
      "spellSpiderClimb",
      "spellSuggestion",
      "spellWeb",
      "spellBlink",
      "spellClairvoyance",
      "spellCounterspell",
      "spellDaylight",
      "spellDispelMagic",
      "spellFear",
      "spellFireball",
      "spellFly",
      "spellGaseousForm",
      "spellHaste",
      "spellHypnoticPattern",
      "spellLightningBolt",
      "spellMajorImage",
      "spellProtectionFromEnergy",
      "spellSleetStorm",
      "spellSlow",
      "spellStinkingCloud",
      "spellTongues",
      "spellWaterBreathing",
      "spellWaterWalk",
      "spellBanishment",
      "spellBlight",
      "spellConfusion",
      "spellDimensionDoor",
      "spellDominateBeast",
      "spellGreaterInvisibility",
      "spellIceStorm",
      "spellPolymorph",
      "spellStoneskin",
      "spellWallOfFire",
      "spellAnimateObjects",
      "spellCloudkill",
      "spellConeOfCold",
      "spellCreation",
      "spellDominatePerson",
      "spellHoldMonster",
      "spellInsectPlague",
      "spellSeeming",
      "spellTelekinesis",
      "spellTeleportationCircle",
      "spellWallOfStone",
      "spellArcaneGate",
      "spellChainLightning",
      "spellCircleOfDeath",
      "spellDisintegrate",
      "spellEyebite",
      "spellGlobeOfInvulnerability",
      "spellMassSuggestion",
      "spellMoveEarth",
      "spellSunbeam",
      "spellTrueSeeing",
      "spellDelayedBlastFireball",
      "spellEtherealness",
      "spellFingerOfDeath",
      "spellFireStorm",
      "spellPlaneShift",
      "spellPrismaticSpray",
      "spellReverseGravity",
      "spellTeleport",
      "spellDominateMonster",
      "spellEarthquake",
      "spellIncendiaryCloud",
      "spellPowerWordStun",
      "spellSunburst",
      "spellGate",
      "spellMeteorSwarm",
      "spellPowerWordKill",
      "spellTimeStop",
      "spellWish"
    ],
    "description": "An event in your past, or in the life of a parent or ancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells./nSpell Save DC = 8 + your proficiency bonus + your Charisma modifier /nSpell attack modifier = your proficiency bonus + your Charisma modifier",
    "classes": [
      "Sorcerer"
    ],
    "tags": [
      "Sorcerer",
      "Spellcasting"
    ],
    "levelingInfo": [
      [
        "4",
        "2",
        "2",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "3",
        "3",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "4",
        "2",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "5",
        "5",
        "4",
        "3",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "5",
        "6",
        "4",
        "3",
        "2",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "5",
        "7",
        "4",
        "3",
        "3",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "5",
        "8",
        "4",
        "3",
        "3",
        "1",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "5",
        "9",
        "4",
        "3",
        "3",
        "2",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "5",
        "10",
        "4",
        "3",
        "3",
        "3",
        "1",
        "",
        "",
        "",
        ""
      ],
      [
        "6",
        "11",
        "4",
        "3",
        "3",
        "3",
        "2",
        "",
        "",
        "",
        ""
      ],
      [
        "6",
        "12",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "",
        "",
        ""
      ],
      [
        "6",
        "12",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "",
        "",
        ""
      ],
      [
        "6",
        "13",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "",
        ""
      ],
      [
        "6",
        "13",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "",
        ""
      ],
      [
        "6",
        "14",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        ""
      ],
      [
        "6",
        "14",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        ""
      ],
      [
        "6",
        "15",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "6",
        "15",
        "4",
        "3",
        "3",
        "3",
        "3",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "6",
        "15",
        "4",
        "3",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1"
      ],
      [
        "6",
        "15",
        "4",
        "3",
        "3",
        "3",
        "3",
        "2",
        "2",
        "1",
        "1"
      ]
    ]
  },
  {
    "id": "featureSorcerousOrigin",
    "name": "Sorcerous Origin",
    "content": [
      "featureDraconicBloodline",
      "featureWildMagic"
    ],
    "description": "Choose a sorcerous origin, which describes the course of your innate magical power: Draconic Bloodline or Wild Magic, both detailed at the end of the class description./nYour choice grants you features when you choose it at 1st level and again at 6th, 14th, and 18th level.",
    "classes": [
      "Sorcerer"
    ],
    "tags": [
      "Sorcerer"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureDraconicBloodline",
    "name": "Draconic Bloodline",
    "content": [
      "featureDragonAncestor",
      "featureDraconicResilience"
    ],
    "description": "Your innate magic comes from draconic magic that was mingled with your blood or that of your ancestors. Most often, sorcerers with this origin trace their descent back to a mighty sorcerer of ancient times who made a bargain with a dragon or who might have even claimed a dragon parent. Some of these bloodlines are well established in the world, but most are obscure. Any given sorcerer could be the first of a new bloodline, as a result of a pact or some other exceptional circumstance.",
    "classes": [
      "Sorcerer"
    ],
    "tags": [
      "Sorcerer"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureDragonAncestor",
    "name": "Dragon Ancestor",
    "content": [],
    "description": "At 1st level, you choose one type of dragon as your ancestor. The damage type associated with each dragon is used by features you gain later./nBlack - Acid/nBlue - Lightning/nBrass - Fire/nBronze - Lightning/n Copper - Acid/n Gold - Fire/n Green - Poison/nRed - Fire/nSilver - Cold/nWhite - Cold/nYou can speak, read, and write draconic. Additionally, whenever you make a Charisma check when interacting with dragons, your proficiency bonus is doubled if it applies to the check.",
    "classes": [
      "Sorcerer"
    ],
    "tags": [
      "Sorcerer"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureDraconicResilience",
    "name": "Draconic Resilience",
    "content": [],
    "description": "As magic flows through your body, it causes physical traits of your dragon ancestors to emerge. At 1st level, your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class./nAdditionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren'y wearing armor, your AC equals 13 + your Dexterity modifier.",
    "classes": [
      "Sorcerer"
    ],
    "tags": [
      "Sorcerer"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureWildMagic",
    "name": "Wild Magic",
    "content": [
      "featureWildMagicSurge",
      "featureTidesOfChaos"
    ],
    "description": "Your innate magic comes from the wild forces of chaos that underlie the order of creation. You might have endured exposure to some form of raw magic, perhaps through a planar portal leading to Limbo, the Elemental Planes, or the mysterious Far Realm. Perhaps you were blessed by a powerful fey creature or marked by a demon. Or your magic could be a fluke of your birth, with no apparent cause or reason. However it came to be, this chaotic magic churns within you, waiting for an outlet.",
    "classes": [
      "Sorcerer"
    ],
    "tags": [
      "Sorcerer"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureWildMagicSurge",
    "name": "Wild Magic Surge",
    "content": [],
    "description": "Starting when you choose this origin at 1st level, your spellcasting can unleash surges of untamed magic. Immediately after you cast a sorcerer spell of 1st level or higher, the DM can have you roll a d20. If you roll a 1, roll on the Wild Magic Surge table to create a random magical effect.",
    "classes": [
      "Sorcerer"
    ],
    "tags": [
      "Sorcerer"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTidesOfChaos",
    "name": "Tides of Chaos",
    "content": [],
    "description": "Starting at 1st level, you can manipulate the forces of chance and chaos to gain advantage on one attack roll, ability check, or saving throw. Once you do so, you must finish a long rest before you can use this feature again./nAny time before you regain the use of this feature, the DM can have you roll on the Wild Magic Surge table immediately after you cast a sorcerer spell of 1st level or higher. You then regain the use of this feature.",
    "classes": [
      "Sorcerer"
    ],
    "tags": [
      "Sorcerer"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureOtherworldlyPatron",
    "name": "Otherworldly Patron",
    "content": [
      "featureTheArchfey",
      "featureTheFiend",
      "featureTheGreatOldOne"
    ],
    "description": "At 1st level, you have struck a bargain with an otherworldly being of your choice:the Archfey, the Fiend, or the Great Old One, each of which is detailed at the end of the class description. Your choice grants you features at 1st level, and again at 6th, 10th, and 14th level.",
    "classes": [
      "Warlock"
    ],
    "tags": [
      "Warlock",
      "The Archfey",
      "The Fiend",
      "The Great Old One"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTheArchfey",
    "name": "Otherworldly Patron: The Archfey",
    "content": [
      "featureTheArchfeyExpandedSpellList",
      "featureFeyPresence"
    ],
    "description": "Your patron is a lord or lady of the fey, a creature of legend who holds secrets that were forgotten before the mortal races were born. This being's motivations are often inscrutable, and sometimes whimsical, and might involve striving for grater magical power or the setling of age-old grudges. Beings of this sort include the Prince of Frost; the Queen of Air and Darkness, ruler of the Gleaming Court; Titania of the Summer Court; her consort Oberon, the Green Lord; Hyrsam, the prince of Fools; and ancient hags.",
    "classes": [
      "Warlock"
    ],
    "tags": [
      "Warlock",
      "The Archfey"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTheArchfeyExpandedSpellList",
    "name": "The Archfey Expanded Spell List",
    "content": [],
    "description": "The Archfey lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you./n1st level spells: faerie fire, sleep/n2nd level spells: calm emotions, phantasmal force/n3rd level spells: blink, plant growth/n4th level spells: dominate beast, greater invisibility/n5th level spells: dominate person, seeming",
    "classes": [
      "Warlock"
    ],
    "tags": [
      "Warlock",
      "The Archfey"
    ],
    "levelingInfo": [
      [
        "spellFaerieFire",
        "spellSleep"
      ],
      [],
      [
        "spellCalmEmotions",
        "spellPhantasmalForce"
      ],
      [],
      [
        "spellBlink",
        "spellPlantGrowth"
      ],
      [],
      [
        "spellDominateBeast",
        "spellGreaterInvisibility"
      ],
      [],
      [
        "spellDominatePerson",
        "spellSeeming"
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      []
    ]
  },
  {
    "id": "featureFeyPresence",
    "name": "Fey Presence",
    "content": [],
    "description": "Starting at 1st level, your patron bestows upon you the ability to project the beguiling and fearsome presence of the fey. As an action, you can cause each creature in a 10-foot cube originating from you to make a Wisdom saving throw against your warlock spell save DC. THe creatures that fail their saving throws are all charmed or frightened by you (your choice) until the end of your next turn./nOnce you use this feature, you can't use it again until you finish a short or long rest.",
    "classes": [
      "Warlock"
    ],
    "tags": [
      "Warlock",
      "The Archfey"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTheFiend",
    "name": "Otherworldly Patron: The Fiend",
    "content": [
      "featureTheFiendExpandedSpellList",
      "featureDarkOnesBlessing"
    ],
    "description": "You have made a pact with a fiend from the lower planes of existence, a being whose aims are evil, even if you strive against those aims. Such beings desire the corruption or destruction of all things, ultimately including you. Fiends powerful enough to forge a pact include demon lords such as Demogorgon, Orcus, Fraz'Urb-luu, and Baphomet; archdevils such as Asmodeus, Dispater, Mephistopheles, and Belial; pit fiends and balors that are especially mighty; and ultroloths and other lords of the yugoloths.",
    "classes": [
      "Warlock"
    ],
    "tags": [
      "Warlock",
      "The Fiend"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTheFiendExpandedSpellList",
    "name": "The Fiend Expanded Spell List",
    "content": [],
    "description": "The Fiend lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you./n1st level spells: burning hands, command/n2nd level spells: blindness/deafness, scorching ray/n3rd level spells: fireball, stinking cloud/n4th level spells: fire shield, wall of fire/n5th level spells: flame strike, hallow",
    "classes": [
      "Warlock"
    ],
    "tags": [
      "Warlock",
      "The Fiend"
    ],
    "levelingInfo": [
      [
        "spellBurningHands",
        "spellCommand"
      ],
      [],
      [
        "spellBlindnessDeafness",
        "spellScorchingRay"
      ],
      [],
      [
        "spellFireball",
        "spellStinkingCloud"
      ],
      [],
      [
        "spellFireShield",
        "spellWallOfFire"
      ],
      [],
      [
        "spellFlameStrike",
        "spellHallow"
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      []
    ]
  },
  {
    "id": "featureDarkOnesBlessing",
    "name": "Dark One's Blessing",
    "content": [],
    "description": "Starting at 1st level, when you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum of 1).",
    "classes": [
      "Warlock"
    ],
    "tags": [
      "Warlock",
      "The Fiend"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTheGreatOldOne",
    "name": "Otherworldly Patron: The Great Old One",
    "content": [
      "featureTheGreatOldOneExpandedSpellList",
      "featureAwakenedMind"
    ],
    "description": "Your patron is a mysterious entity whiose nature is utterly foreign to the fabric of reality. It might come from the Far Realm, the space beyond reality, or it could be one of the elder gods known only in legends. Its motives are incomprehensible to mortals, and its knowledge so immense and ancient that even the greatest libraries pale in comparison to the vast secrets it holds. The Great Old One might be unaware of your existence or entirely indifferent to you, but the secrets you have learned allow you to draw your magic from it./nEntities of this type include Ghaundar, called That Which Lurks; Tharizdun, the Chained God; Dendar, the Night Serpent; Zargon, the Returner; Great Cthulhu; and other unfathomable beings.",
    "classes": [
      "Warlock"
    ],
    "tags": [
      "Warlock",
      "The Great Old One"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureTheFGreatOldOneExpandedSpellList",
    "name": "The Great Old One Expanded Spell List",
    "content": [],
    "description": "The Great Old One lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you./n1st level spells: dissonant whispers, Tasha's hideous laughter/n2nd level spells: detect thoughts, phantasmal force/n3rd level spells: clairvoyance, sending/n4th level spells: dominate beast, Evard's black tentacles/n5th level spells: dominate person, telekinesis",
    "classes": [
      "Warlock"
    ],
    "tags": [
      "Warlock",
      "The Great Old One"
    ],
    "levelingInfo": [
      [
        "spellDissonantWhispers",
        "spellTashasHideousLaughter"
      ],
      [],
      [
        "spellDetectThoughts",
        "spellPhantasmalForce"
      ],
      [],
      [
        "spellClairvoyance",
        "spellSending"
      ],
      [],
      [
        "spellDominateBeast",
        "spellEvardsBlackTentacles"
      ],
      [],
      [
        "spellDominatePerson",
        "spellTelekinesis"
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      []
    ]
  },
  {
    "id": "featureAwakenedMind",
    "name": "Awakened Mind",
    "content": [],
    "description": "Starting at 1st level, your alien knowledge gives you the ability to touch the minds of outher creatures. You can communicate telepathically wih any creature you can see within 30 feet of you. You don't need to share a language with the creature for it to understand your telepathic utterances, but the creature must be able to understand at least one language.",
    "classes": [
      "Warlock"
    ],
    "tags": [
      "Warlock",
      "The Great Old One"
    ],
    "levelingInfo": [
      []
    ]
  },
  {
    "id": "featureSpellcastingWarlock",
    "name": "Pact Magic",
    "content": [
      "spellBladeWard",
      "spellChillTouch",
      "spellEldritchBlast",
      "spellFriends",
      "spellMageHand",
      "spellMinorIllusion",
      "spellPoisonSpray",
      "spellPrestidigitation",
      "spellTrueStrike",
      "spellArmorOfAgathys",
      "spellArmsOfHadar",
      "spellCharmPerson",
      "spellComprehendLanguages",
      "spellExpeditiousRetreat",
      "spellHellishRebuke",
      "spellHex",
      "spellIllusoryScript",
      "spellProtectionFromEvilAndGood",
      "spellUnseenServant",
      "spellWitchBolt",
      "spellCloudOfDaggers",
      "spellCrownOfMadness",
      "spellDarkness",
      "spellEnthrall",
      "spellHoldPerson",
      "spellInvisibility",
      "spellMirrorImage",
      "spellMistyStep",
      "spellRayOfEnfeeblement",
      "spellShatter",
      "spellSpiderClimb",
      "spellSuggestion",
      "spellCounterspell",
      "spellDispelMagic",
      "spellFear",
      "spellFly",
      "spellGaseousForm",
      "spellHungerOfHadar",
      "spellHypnoticPattern",
      "spellMagicCircle",
      "spellMajorImage",
      "spellRemoveCurse",
      "spellTongues",
      "spellVampiricTouch",
      "spellBanishment",
      "spellBlight",
      "spellDimensionDoor",
      "spellHallucinatoryTerrain",
      "spellContactOtherPlane",
      "spellDream",
      "spellHoldMonster",
      "spellScrying",
      "spellArcaneGate",
      "spellCircleOfDeath",
      "spellConjureFey",
      "spellCreateUndead",
      "spellEyebite",
      "spellFleshToStone",
      "spellMassSuggestion",
      "spellTrueSeeing",
      "spellEtherealness",
      "spellFingerOfDeath",
      "spellForcecage",
      "spellPlaneShift",
      "spellDemiplane",
      "spellDominateMonster",
      "spellFeeblemind",
      "spellGlibness",
      "spellPowerWordStun",
      "spellAstralProjection",
      "spellForesight",
      "spellImprisonment",
      "spellPowerWordKill",
      "spellTruePolymorph"
    ],
    "description": "Your arcane research and the magic bestowed upon you by your patron have given you facility with spells./nSpell Save DC = 8 + your proficiency bonus + your Charisma modifier /nSpell attack modifier = your proficiency bonus + your Charisma modifier",
    "classes": [
      "Warlock"
    ],
    "tags": [
      "Warlock",
      "Spellcasting",
      "Pact Magic"
    ],
    "levelingInfo": [
      [
        "2",
        "2",
        "1",
        "1",
        ""
      ],
      [
        "2",
        "3",
        "2",
        "1",
        "2"
      ],
      [
        "2",
        "4",
        "2",
        "2",
        "2"
      ],
      [
        "3",
        "5",
        "2",
        "2",
        "2"
      ],
      [
        "3",
        "6",
        "2",
        "3",
        "3"
      ],
      [
        "3",
        "7",
        "2",
        "3",
        "3"
      ],
      [
        "3",
        "8",
        "2",
        "4",
        "4"
      ],
      [
        "3",
        "9",
        "2",
        "4",
        "4"
      ],
      [
        "3",
        "10",
        "2",
        "5",
        "5"
      ],
      [
        "4",
        "10",
        "2",
        "5",
        "5"
      ],
      [
        "4",
        "11",
        "3",
        "5",
        "5"
      ],
      [
        "4",
        "11",
        "3",
        "5",
        "6"
      ],
      [
        "4",
        "12",
        "3",
        "5",
        "6"
      ],
      [
        "4",
        "12",
        "3",
        "5",
        "6"
      ],
      [
        "4",
        "13",
        "3",
        "5",
        "7"
      ],
      [
        "4",
        "13",
        "3",
        "5",
        "7"
      ],
      [
        "4",
        "14",
        "4",
        "5",
        "7"
      ],
      [
        "4",
        "14",
        "4",
        "5",
        "8"
      ],
      [
        "4",
        "15",
        "4",
        "5",
        "8"
      ],
      [
        "4",
        "15",
        "4",
        "5",
        "8"
      ]
    ]
  },
  {
    "id": "featureSpellcastingWizard",
    "name": "Wizard Spellcasting",
    "content": [
      "spellAcidSplash",
      "spellBladeWard",
      "spellChillTouch",
      "spellDancingLights",
      "spellFireBolt",
      "spellFriends",
      "spellLight",
      "spellMageHand",
      "spellMending",
      "spellMessage",
      "spellMinorIllusion",
      "spellPoisonSpray",
      "spellPrestidigitation",
      "spellRayOfFrost",
      "spellShockingGrasp",
      "spellTrueStrike",
      "spellAlarm",
      "spellBurningHands",
      "spellCharmPerson",
      "spellChromaticOrb",
      "spellColorSpray",
      "spellComprehendLanguages",
      "spellDetectMagic",
      "spellDisguiseSelf",
      "spellExpeditiousRetreat",
      "spellFalseLife",
      "spellFeatherFall",
      "spellFindFamiliar",
      "spellFogCloud",
      "spellGrease",
      "spellIdentify",
      "spellIllusoryScript",
      "spellJump",
      "spellLongstrider",
      "spellMageArmor",
      "spellMagicMissile",
      "spellProtectionFromEvilAndGood",
      "spellRayOfSickness",
      "spellShield",
      "spellSilentImage",
      "spellSleep",
      "spellTashasHideousLaughter",
      "spellTensersFloaticDisk",
      "spellThunderwave",
      "spellUnseenServant",
      "spellWitchBolt",
      "spellAlterSelf",
      "spellArcaneLock",
      "spellBlindnessDeafness",
      "spellBlur",
      "spellCloudOfDaggers",
      "spellContinualFlame",
      "spellCrownOfMadness",
      "spellDarkness",
      "spellDarkvision",
      "spellDetectThoughts",
      "spellEnlargeReduce",
      "spellFlamingSphere",
      "spellGentleRepose",
      "spellGustOfWind",
      "spellHoldPerson",
      "spellInvisibility",
      "spellKnock",
      "spellLevitate",
      "spellLocateObject",
      "spellMagicMouth",
      "spellMagicWeapon",
      "spellMelfsAcidArrow",
      "spellMirrorImage",
      "spellMistyStep",
      "spellNystulsMagicAura",
      "spellPhantasmalForce",
      "spellRayOfEnfeeblement",
      "spellRopeTrick",
      "spellScorchingRay",
      "spellSeeInvisibility",
      "spellShatter",
      "spellSpiderClimb",
      "spellSuggestion",
      "spellWeb",
      "spellAnimateDead",
      "spellBestowCurse",
      "spellBlink",
      "spellClairvoyance",
      "spellCounterspell",
      "spellDispelMagic",
      "spellFear",
      "spellFeignDeath",
      "spellFireball",
      "spellFly",
      "spellGaseousForm",
      "spellGlyphOfWarding",
      "spellHaste",
      "spellHypnoticPattern",
      "spellLeomundsTinyHut",
      "spellLightningBolt",
      "spellMagicCircle",
      "spellMajorImage",
      "spellNondetection",
      "spellPhantomSteed",
      "spellProtectionFromEnergy",
      "spellRemoveCurse",
      "spellSending",
      "spellSleetStorm",
      "spellSlow",
      "spellStinkingCloud",
      "spellTongues",
      "spellVampiricTouch",
      "spellWaterBreathing",
      "spellArcaneEye",
      "spellBanishment",
      "spellBlight",
      "spellConfusion",
      "spellConjureMinorElementals",
      "spellControlWater",
      "spellDimensionDoor",
      "spellEvardsBlackTentacles",
      "spellFabricate",
      "spellFireShield",
      "spellGreaterInvisibility",
      "spellHallucinatoryTerrain",
      "spellIceStorm",
      "spellLeomundsSecretChest",
      "spellLocateCreature",
      "spellMordenkainensPrivateSanctum",
      "spellOtilukesResilientSphere",
      "spellPhantasmalKiller",
      "spellPolymorph",
      "spellStoneShape",
      "spellStoneskin",
      "spellWallOfFire",
      "spellAnimateObjects",
      "spellBigbysHand",
      "spellCloudkill",
      "spellConeOfCold",
      "spellConjureElemental",
      "spellContactOtherPlane",
      "spellCreation",
      "spellDominatePerson",
      "spellDream",
      "spellGeas",
      "spellHoldMonster",
      "spellLegendLore",
      "spellMislead",
      "spellModifyMemory",
      "spellPasswall",
      "spellPlanarBinding",
      "spellRarysTelepathicBond",
      "spellScrying",
      "spellSeeming",
      "spellTelekinesis",
      "spellTeleportationCircle",
      "spellWallOfForce",
      "spellWallOfStone",
      "spellArcaneGate",
      "spellChainLightning",
      "spellCircleOfDeath",
      "spellContingency",
      "spellCreateUndead",
      "spellDisintegrate",
      "spellDrawmijsInstantSummons",
      "spellEyebite",
      "spellFleshToStone",
      "spellGlobeOfInvulnerability",
      "spellGuardsAndWards",
      "spellMagicJar",
      "spellMassSuggestion",
      "spellMoveEarth",
      "spellOtilukesFreezingSphere",
      "spellOttosIrresistibleDance",
      "spellProgrammedIllusion",
      "spellSunbeam",
      "spellTrueSeeing",
      "spellWallOfIce",
      "spellDelayedBlastFireball",
      "spellEtherealness",
      "spellFingerOfDeath",
      "spellForcecage",
      "spellMirageArcane",
      "spellMordenkainensMagnificentMansion",
      "spellMordenkainensSword",
      "spellPlaneShift",
      "spellPrismaticSpray",
      "spellProjectImage",
      "spellReverseGravity",
      "spellSequester",
      "spellSimulacrum",
      "spellSymbol",
      "spellTeleport",
      "spellAntimagicField",
      "spellAntipathySympathy",
      "spellClone",
      "spellControlWeather",
      "spellDemiplane",
      "spellDominateMonster",
      "spellFeeblemind",
      "spellIncendiaryCloud",
      "spellMaze",
      "spellMindBlank",
      "spellPowerWordStun",
      "spellSunburst",
      "spellTelepathy",
      "spellTrapTheSoul",
      "spellAstralProjection",
      "spellForesight",
      "spellGate",
      "spellImprisonment",
      "spellMeteorSwarm",
      "spellPowerWordKill",
      "spellPrismaticWall",
      "spellShapechange",
      "spellTimeStop",
      "spellTruePolymorph",
      "spellWeird",
      "spellWish"
    ],
    "description": "As a student of arcane magic, you have a spellbook containing spells that show the first glimmerings of your true power./nSpell Save DC = 8 + your proficiency bonus + your Intelligence modifier/nSpell attack modifier = your proficiency bonus + your Intelligence modifier",
    "classes": [
      "Wizard"
    ],
    "tags": [
      "Wizard",
      "Spellcasting"
    ],
    "levelingInfo": [
      [
        "3",
        "2",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "3",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "3",
        "4",
        "2",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "2",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "1",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "2",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "4",
        "4",
        "3",
        "3",
        "3",
        "1",
        "",
        "",
        "",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "",
        "",
        "",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "",
        "",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "",
        "",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        ""
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "3",
        "1",
        "1",
        "1",
        "1"
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "3",
        "2",
        "1",
        "1",
        "1"
      ],
      [
        "5",
        "4",
        "3",
        "3",
        "3",
        "3",
        "2",
        "2",
        "1",
        "1"
      ]
    ]
  },
  {
    "id": "featureArcaneRecovery",
    "name": "Arcane Recovery",
    "content": [],
    "description": "You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. THe spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher./nFor example, if you're a 4th level wizard, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell slot or two 1st-level spell slots.",
    "classes": [
      "Wizard"
    ],
    "tags": [
      "Wizard"
    ],
    "levelingInfo": [
      []
    ]
  }
]
