[
  {
    "id": "raceHillDwarf",
    "name": "Hill Dwarf",
    "description": "As a hill dwarf, you have keen senses, deep intuition, and remarkable resilience. Your hill dwarf character has an assortment of inborn abilities, part and parcel of dwarven nature.",
    "ability score": [0,0,2,0,1,0],
    "age": 50,
    "heightInches": 44,
    "isMedium":true,
    "speed":25,
    "traits": [
      [
        "Alignment","Most dwarves are lawful, believing firmly in the benefits of a well-ordered society.","They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order."
      ],
      [
        "Languages","You can speak, read, and write Common and Dwarvish","Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak."
      ],
      ["Darkvision","Accustomed to life underground, you have superior vision in dark and dim conditions","You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light","You can’t discern color in darkness, only shades of gray."
      ],
      ["Dwarven Combat Training","You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."
      ],
      ["Dwarven Resilience","You have advantage on saving throws against poison, and you have resistance against poison damage."
      ],
      ["Tool Proficiency","You gain proficiency with the artisan’s tools of your choice: smith’s tools, brewer’s supplies, or mason’s tools."
      ],
      ["Stonecunning","Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
      ],
      ["Dwarven Toughness","Your hit point maximum increases by 1, and it increases by 1 every time you gain a level."
      ]
    ]
  },
  {
    "id": "raceMountainDwarf",
    "name": "Mountain Dwarf",
    "description": "As a mountain dwarf, you're strong and hardy, accustomed to a difficult life in rugged terrain. You're probably on the tall side (for a dwarf), and tend toward lighter coloration.",
    "ability score": [1,0,2,0,0,0],
    "age": 50,
    "heightInches": 48,
    "isMedium":true,
    "speed":25,
    "traits":[
      ["Alignment","Most dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order."],
      ["Languages","You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak."],
      ["Darkvision","Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."],
      ["Dwarven Combat Training","You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."],
      ["Dwarven Resilience","You have advantage on saving throws against poison, and you have resistance against poison damage."],
      ["Tool Proficiency","You gain proficiency with the artisan’s tools of your choice: smith’s tools, brewer’s supplies, or mason’s tools."],
      ["Stonecunning","Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."],
      ["Dwarven Armor Training","You have proficiency with light and medium armor."],
      ["Tool Proficiency","You gain proficiency with the artisan’s tools of your choice: smith’s tools, brewer’s supplies, or mason’s tools."],
      ["Stonecunning","Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."]
    ]
  },
  {
    "id":"raceHighElf",
    "name": "High Elf",
    "description": "",
    "ability score": [0,2,0,1,0,0],
    "age": 100,
    "heightInches": 54,
    "isMedium":true,
    "speed":30,
    "traits": [
      ["Alignment","Elves love freedom, variety, and self- expression, so they lean strongly toward the gentler aspects of chaos. They value and protect others’ freedom as well as their own, and they are more often good than not. The drow are an exception; their exile has made them vicious and dangerous. Drow are more often evil than not."],
      ["Darkvision","Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray"],
      ["Keen Senses","You have proficiency in the Perception skill"],
      ["Fey Ancestry","You have advantage on saving throws against being charmed, and magic can’t put you to sleep"],
      ["Trance","Elves don’t need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is “trance.”) While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep"],
      ["Elf Weapon Training","You have proficiency with the longsword, shortsword, shortbow, and longbow"],
      ["Cantrip","You know one cantrip of your choice from the wizard spell list. Intelligence is your spellcasting ability for it"],
      ["Languages","You can speak, read, and write one extra language of your choice. You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."]
    ]
  },
  {
    "id":"raceDarkElf",
    "name": "Dark Elf",
    "description": "Descended from an earlier subrace of dark-skinned elves, the drow were banished from the surface world for following the goddess Lolth down the path to evil and corruption.",
    "ability score": [0,2,0,0,0,1],
    "age": 100,
    "heightInches": 53,
    "isMedium":true,
    "speed":30,
    "traits": [
      ["Alignment","The drow are the exception to the normal Elven alignment; their exile has made them vicious and dangerous. Drow are more often evil than not"],
      ["Superior Darkvision","Your darkvisin has a radius of 120 feet"],
      ["Keen Senses","You have proficiency in the Perception skill"],
      ["Fey Ancestry","You have advantage on saving throws against being charmed, and magic can’t put you to sleep"],
      ["Trance","Elves don’t need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is “trance.”) While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep"],
      ["Sunlight Sensitivity","You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to percieve is in direct sunlight"],
      ["Drow Magic","You know the dancing lights cantrip. When you reach 3rd level, you can cast the faerie fire spell once per day. When you reach 5th level, you can also cast the darkness spell once per day. Charisma is your spellcasting ability for these spells"],
      ["Drow Weapon Training","You have proficiency with the rapiers, shortswords, and hand crossbows."],
      ["Languages","You can speak, read, and write one extra language of your choice. You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."]
    ]
  },
  {
    "id":"raceWoodElf",
    "name": "Wood Elf",
    "description": "As a wood elf, you have keen senses and intuition, and your fleet feet carry you quickly and stealthily through your native forests. Wood elves tend to have copperish skin hues, sometimes with traces of green. their hair tends towards browns and blacks, but is occasionally blond or copper-colored. Their eyes are green, brown, or hazel.",
    "ability score": [0,2,0,0,1,0],
    "age": 100,
    "heightInches": 54,
    "isMedium":true,
    "speed":35,
    "traits": [
      ["Alignment","Elves love freedom, variety, and self- expression, so they lean strongly toward the gentler aspects of chaos. They value and protect others’ freedom as well as their own, and they are more often good than not. The drow are an exception; their exile has made them vicious and dangerous. Drow are more often evil than not"],
      ["Darkvision","Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray"],
      ["Keen Senses","You have proficiency in the Perception skill"],
      ["Fey Ancestry","You have advantage on saving throws against being charmed, and magic can’t put you to sleep"],
      ["Trance","Elves don’t need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is “trance.”) While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep"],
      ["Elf Weapon Training","You have proficiency with the longsword, shortsword, shortbow, and longbow"],
      ["Mask of the Wild","You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena"],
      ["Languages","You can speak, read, and write one extra language of your choice. You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."]
    ]
  },
  {
    "id":"raceHalfling",
    "name": "Halfling",
    "description": "",
    "ability score": [0,2,0,0,0,0],
    "age": 20,
    "heightInches": 31,
    "isMedium":false,
    "speed":25,
    "traits": [
      ["Alignment","Most halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways"],
      ["Lucky","When you roll a 1 on the d20 for an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll"],
      ["Brave","You have advantage on saving throws against being frightened"],
      ["Halfling Nimbleness","You can move through the space of any creature that is of a size larger than yours"],
      ["Languages","You can speak, read, and write Common and Halfling. The Halfling language isn’t secret, but halflings are loath to share it with others. They write very little, so they don’t have a rich body of literature. Their oral tradition, however, is very strong. Almost all halflings speak Common to converse with the people in whose lands they dwell or through which they are traveling."]
    ]
  },
  {
    "id":"raceStout",
    "name": "Stout",
    "description": "As a stout halfling, you're hardier than average and have some resistance to poison. some say that stouts have dwarven blood. ",
    "ability score": [0,2,1,0,0,0],
    "age": 20,
    "heightInches": 31,
    "isMedium":false,
    "speed":25,
    "traits": [
      ["Alignment","Most halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways"],
      ["Stout Resilience","you have advantage on saving throws against poison, and you have resistance against poison damage"],
      ["Lucky","When you roll a 1 on the d20 for an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll"],
      ["Brave","You have advantage on saving throws against being frightened"],
      ["Halfling Nimbleness","You can move through the space of any creature that is of a size larger than yours"],
      ["Languages","You can speak, read, and write Common and Halfling. The Halfling language isn’t secret, but halflings are loath to share it with others. They write very little, so they don’t have a rich body of literature. Their oral tradition, however, is very strong. Almost all halflings speak Common to converse with the people in whose lands they dwell or through which they are traveling."]
    ]
  },
  {
    "id":"raceLightFoot",
    "name": "LightFoot",
    "description": "As a lightfoot, you can easily hide from notice, even using other people as cover. You’re inclined to be affable and get along well with others. Lightfoots are more prone to wanderlust than other halflings, and often dwell alongside other races or take up a nomadic life.",
    "ability score": [0,2,0,0,0,1],
    "age": 20,
    "heightInches": 31,
    "isMedium":false,
    "speed":25,
    "traits": [
      ["Alignment","Most Lightfoots are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways"],
      ["Lucky","When you roll a 1 on the d20 for an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll"],
      ["Brave","You have advantage on saving throws against being frightened"],
      ["Halfling Nimbleness","You can move through the space of any creature that is of a size larger than yours"],
      ["Naturally Stealthy","You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you."],
      ["Languages","You can speak, read, and write Common and Halfling. The Halfling language isn’t secret, but halflings are loath to share it with others. They write very little, so they don’t have a rich body of literature. Their oral tradition, however, is very strong. Almost all halflings speak Common to converse with the people in whose lands they dwell or through which they are traveling."]
    ]
  },
  {
    "id":"raceHuman",
    "name":"Human",
    "description": "It’s hard to make generalizations about humans, but your human character has these traits.",
    "ability score": [1,1,1,1,1,1],
    "age": 18,
    "heightInches": 56,
    "isMedium":true,
    "speed":30,
    "traits": [
      ["Alignment","Humans tend toward no particular alignment. The best and the worst are found among them."],
      ["Languages","Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."]
    ]
  },
  {
    "id":"raceDragonborn",
    "name":"Dragonborn",
    "description": "Your draconic heritage manifests in a variety of traits you share with other dragonborn.",
    "ability score": [2,0,0,0,0,1],
    "age": 15,
    "heightInches": 66,
    "isMedium":true,
    "speed":30,
    "traits": [
      ["Alignment","Dragonborn tend to extremes, making a conscious choice for one side or the other in the cosmic war between good and evil. Most dragonborn are good, but those who side with evil can be terrible villains."],
      ["Draconic Ancestry","You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table."],
      ["Black Dragon","Damage Type Acid, Breath Weapon 5 by 30 ft. line (Dex. save). "],
      ["Blue Dragon","Damage Type Lightning, Breath Weapon 5 by 30 ft. line (Dex. save). "],
      ["Brass Dragon","Damage Type Fire, Breath Weapon 5 by 30 ft. line (Dex. save). "],
      ["Bronze Dragon","Damage Type Lightning, Breath Weapon 5 by 30 ft. line (Dex. save). "],
      ["Copper Dragon","Damage Type Acid, Breath Weapon 5 by 30 ft. line (Dex. save). "],
      ["Gold Dragon","Damage Type Fire, Breath Weapon 15 ft. cone (Dex. save). "],
      ["Green Dragon","Damage Type Poison, Breath Weapon 15 ft. cone (Dex. save). "],
      ["Red Dragon","Damage Type Fire, Breath Weapon 15 ft. cone (Dex. save). "],
      ["Silver Dragon","Damage Type Cold, Breath Weapon 15 ft. cone (Dex. save). "],
      ["White Dragon","Damage Type Cold, Breath Weapon 15 ft. cone (Dex. save). "],
      ["Breath Weapon","You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation. When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level. After you use your breath weapon, you can’t use it again until you complete a short or long rest."],
      ["Damage Resistance","You have resistance to the damage type associated with your draconic ancestry."],
      ["Languages","You can speak, read, and write Common and Draconic. Draconic is thought to be one of the oldest languages and is often used in the study of magic. The language sounds harsh to most other creatures and includes numerous hard consonants and sibilants."]
    ]
  },
  {
    "id":"raceGnome",
    "name":"Gnome",
    "description": "Your gnome character has certain characteristics in common with all other gnomes.",
    "ability score": [0,0,0,2,0,0],
    "age": 40,
    "heightInches": 35,
    "isMedium":false,
    "speed":25,
    "traits": [
      ["Alignment","Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-hearted, and even the tricksters among them are more playful than vicious."],
      ["Darkvision","Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."],
      ["Gnome Cunning","You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic."],
      ["Languages","You can speak, read, and write Common and Gnomish. The Gnomish language, which uses the Dwarvish script, is renowned for its technical treatises and its catalogs of knowledge about the natural world."]
    ]
  },
  {
    "id":"raceForestGnome",
    "name":"Forest Gnome",
    "description": "As a forest gnome, you ahve a natural knack for illusion and inherent quickness and stealth..",
    "ability score": [0,1,0,2,0,0],
    "age": 40,
    "heightInches": 35,
    "isMedium":false,
    "speed":25,
    "traits": [
      ["Alignment","Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-hearted, and even the tricksters among them are more playful than vicious."],
      ["Darkvision","Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."],
      ["Gnome Cunning","You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic."],
      ["Natural Illusionist","you know the minor illusion cantrip. Intelligence is your spellcasting ability for it."],
      ["Speak with Small Beasts","Through sounds and gestures, you can communicate simple ideas with Small or smaller beasts. Forest gnomes love animals and often keep squirrels, badgers, rabbits, moles, woodpeckers, and other creatures as beloved pets."],
      ["Languages","You can speak, read, and write Common and Gnomish. The Gnomish language, which uses the Dwarvish script, is renowned for its technical treatises and its catalogs of knowledge about the natural world."]
    ]
  },
  {
    "id":"raceRockGnome",
    "name":"Rock Gnome",
    "description": "As a rock gnome, you have a natural inventiveness and hardiness beyond that of other gnomes.",
    "ability score": [0,0,1,2,0,0],
    "age": 40,
    "heightInches": 35,
    "isMedium":false,
    "speed":25,
    "traits": [
      ["Alignment","Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-hearted, and even the tricksters among them are more playful than vicious."],
      ["Darkvision","Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."],
      ["Gnome Cunning","You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic."],
      ["Languages","You can speak, read, and write Common and Gnomish. The Gnomish language, which uses the Dwarvish script, is renowned for its technical treatises and its catalogs of knowledge about the natural world."],
      ["Artificer’s Lore","Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply."],
      ["Tinker","You have proficiency with artisan’s tools (tinker’s tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time."],
      ["When you create a device, choose one of the following options:",
        "*Clockwork Toy.*","This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noises as appropriate to the creature it represents.\n*Fire Starter.*","The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action.\n*Music Box.*","When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song’s end or when it is closed."
      ]
    ]
  },
  {
    "id":"raceHalf-Elf",
    "name":"Half-Elf",
    "description": "Your half-elf character has some qualities in common with elves and some that are unique to half-elves.",
    "ability score": [0,0,0,0,0,2],
    "age": 20,
    "heightInches": 57,
    "isMedium":true,
    "speed":30,
    "traits": [
      ["Ability Score Increase","Your Charisma score increases by 2, and two other ability scores of your choice increase by 1."],
      ["Alignment","Half-elves share the chaotic bent of their elven heritage. They value both personal freedom and creative expression, demonstrating neither love of leaders nor desire for followers. They chafe at rules, resent others’ demands, and sometimes prove unreliable, or at least unpredictable."],
      ["Darkvision","Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."],
      ["Fey Ancestry","You have advantage on saving throws against being charmed, and magic can’t put you to sleep."],
      ["Skill Versatility","You gain proficiency in two skills of your choice."],
      ["Languages","You can speak, read, and write Common, Elvish, and one extra language of your choice."]
    ]
  },
  {
    "id":"raceHalf-Orc",
    "name":"Half-Orc",
    "description": "Your half-orc character has certain traits deriving from your orc ancestry.",
    "ability score": [2,0,1,0,0,0],
    "age": 14,
    "heightInches": 58,
    "isMedium":true,
    "speed":30,
    "traits": [
      ["Alignment","Half-orcs inherit a tendency toward chaos from their orc parents and are not strongly inclined toward good. Half-orcs raised among orcs and willing to live out their lives among them are usually evil."],
      ["Darkvision","Thanks to your orc blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."],
      ["Menacing","You gain proficiency in the Intimidation skill."],
      ["Relentless Endurance","When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a long rest."],
      ["Savage Attacks","When you score a critical hit with a melee weapon attack, you can roll one of the weapon’s damage dice one additional time and add it to the extra damage of the critical hit."],
      ["Languages","You can speak, read, and write Common and Orc. Orc is a harsh, grating language with hard consonants. It has no script of its own but is written in the Dwarvish script."]
    ]
  },
  {
    "id":"raceTiefling",
    "name":"Tiefling",
    "description": "Tieflings share certain racial traits as a result of their infernal descent",
    "ability score": [0,0,0,1,0,2],
    "age": 18,
    "heightInches": 57,
    "isMedium":true,
    "speed":30,
    "traits": [
      ["Alignment","Tieflings might not have an innate tendency toward evil, but many of them end up there. Evil or not, an independent nature inclines many tieflings toward a chaotic alignment."],
      ["Darkvision","Thanks to your infernal heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."],
      ["Hellish Resistance","You have resistance to fire damage."],
      ["Infernal Legacy","You know the *thaumaturgy* cantrip. When you reach 3rd level, you can cast the *hellish rebuke* spell as a 2nd-level spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the *darkness* spell once with this trait and regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells."],
      ["Languages","You can speak, read, and write Common and Infernal."]
    ]
  }
]
